gdgly/NUC97X_JS/STM32F4xx/Device/GPRS_3763_back.c

//无线GPRS模块 1376.3标准
#if MainProtocol==376
#include "../Head/Project.h"
#include "../Terminal/Terminal_Uart_3761.h"
#include "../terminal/Terminal_USER11xx.h"
#endif
#if MainProtocol==698
#include "../H698/Project698.h"
#include "../DL698/DL698_Uart.h"
#include "../DL698/DL698_DataDef.h"
#endif

#include "../Device/GPRS_3763.h"
#include "../Device/ATNo.h"
#include "../Terminal/ATString.h"
#include "../Device/GPRS_FTP_RxTx.h"
#include "../Device/GPRS_SMS_RxTx.h"
#include "../STM32F4xx/STM32F4xx_IO.h"
#include "../STM32F4xx/STM32F4xx_UART.h"
#include "../STM32F4xx/STM32F4xx_DMA.h"
#include "../STM32F4xx/STM32F4xx_ADC.h"
#include "../Device/MEMRW.h"
#include "../Calculate/Calculate.h"
#include "../Display/Warning.h"
#include "../TEST/LOG.h"



#define NUM_ReATTx     1//AT重发次数(实际发送次数=重发次数+1)


//SocketID 0-5使用约定
//0 主连接
//1 FTP控制
//2 FTP数据
//3-5 未用


__asm void GPRS_3763_AT_Command_Str(void)
{
//波特率检查
ADDR_ATStr_AT
	dcb "AT\r",0
ADDR_ERRStr_AT
	dcb "AT指令无响应",0
	
	//模块信息
//关回显且串口检查
ADDR_ATStr_ATE0
	dcb "ATE0\r",0
ADDR_ERRStr_ATE0
	dcb "没检测到远程无线模块",0

//查询远程通信模块类型
ADDR_ATStr_MYTYPE
	dcb "AT$MYTYPE?\r",0
ADDR_ERRStr_MYTYPE
	dcb "查询远程无线类型失败",0

//获取模块软件版本
ADDR_ATStr_MYGMR
	dcb "AT$MYGMR\r",0
ADDR_ERRStr_MYGMR
	dcb "读远程无线版本失败",0

//卡检查
ADDR_ATStr_CPIN
	dcb "AT+CPIN?\r",0
ADDR_ERRStr_CPIN
	dcb "远程无线无SIM/UIM卡",0

//关主动上报
ADDR_ATStr_MYNETURC
	dcb "AT$MYNETURC=0\r",0
ADDR_ERRStr_MYNETURC
	dcb "关主动上报失败",0

//获取SIM卡序列号ICCID
ADDR_ATStr_MYCCID
	dcb "AT$MYCCID\r",0
ADDR_ERRStr_MYCCID
	dcb "读卡CCID失败",0

//查国际移动台标识请求IMSI
ADDR_ATStr_CIMI
	dcb "AT+CIMI\r",0
ADDR_ERRStr_CIMI
	dcb "查国际移动标识失败",0

/*
//读取SIM卡服务运营商名称
ADDR_ATStr_CSPN
	dcb "AT+CSPN?\r",0
ADDR_ERRStr_CSPN
	dcb "读卡运营商名称失败",0
*/

	//连接设置
//读信号没连接前
ADDR_ATStr_CSQ_NOLINK
	dcb "AT+CSQ\r",0
ADDR_ERRStr_CSQ_NOLINK
	dcb "远程无线读信号失败",0

//获取当前网络注册状态
ADDR_ATStr_CREG
#if (USER/100)==13//黑龙江
	dcb "AT+CGREG?\r",0
#else
	dcb "AT+CREG?\r",0
#endif
ADDR_ERRStr_CREG
	dcb "获取网络注册状态失败",0

//读取SIM卡服务运营商名称
#if (USER/100)!=0//不是电科院测试(1376.3标准无此命令)
ADDR_ATStr_COPS2
	dcb "AT+COPS=0,2\r",0
ADDR_ERRStr_COPS2
	dcb "AT+COPS=2失败",0
ADDR_ATStr_COPS
	dcb "AT+COPS?\r",0
ADDR_ERRStr_COPS
	dcb "读卡运营商名称失败",0
#endif

//取本机号码
ADDR_ATStr_CNUM
	dcb "AT+CNUM\r",0
ADDR_ERRStr_CNUM
	dcb "读本机号码失败",0
	
//查询注册网络类型：3G/4G
ADDR_ATStr_SYSINFO
	dcb "AT$MYSYSINFO\r",0
ADDR_ERRStr_SYSINFO
	dcb "查询是否注册上4G网络",0


//设置APN
ADDR_ATStr_MYNETCON_APN
	dcb "AT$MYNETCON=0,",'"',"APN",'"',',','"',0
ADDR_ERRStr_MYNETCON_APN
	dcb "设置APN失败",0

//设置USERPWD:用户名和密码
ADDR_ATStr_MYNETCON_USERPWD
	dcb "AT$MYNETCON=0,",'"',"USERPWD",'"',',','"',0
ADDR_ERRStr_MYNETCON_USERPWD
	dcb "设置USERPWD失败",0



//激活网络连接
ADDR_ATStr_MYNETACT
	dcb "AT$MYNETACT=0,1\r",0
ADDR_ERRStr_MYNETACT
	dcb "激活网络连接失败",0

//IP访问控制配置
ADDR_ATStr_MYIPFILTER
	dcb "AT$MYIPFILTER=0,1,",0
ADDR_ERRStr_MYIPFILTER
	dcb "IP访问配置失败",0
	
//设置短消息模式(0=PDU,1=TEXT)
ADDR_ATStr_CMFG
 #if SM_CMGF==0//短信模式:0=PDU模式,1=文本模式
	dcb "AT+CMGF=0\r",0
 #else
	dcb "AT+CMGF=1\r",0
 #endif
ADDR_ERRStr_CMFG
	dcb "设置短消息模式失败",0

//打开短信功能(仅中兴CDMA(MC8332)时需要)
ADDR_ATStr_ZCVF
	dcb "AT+ZCVF=2\r",0
ADDR_ERRStr_ZCVF
	dcb "打开短信功能失败",0

//休眠等待时间(仅CDMA时需要);无数据传输时经过10秒后CDMA通信模块主动释放空中接口资源
ADDR_ATStr_CTA
	dcb "AT+CTA=10\r",0
ADDR_ERRStr_CTA
	dcb "设置休眠等待时间失败",0



	//没连接循环开始
//设置服务参数
ADDR_ATStr_MYNETSRV
	dcb 0
ADDR_ERRStr_MYNETSRV
	dcb "设置服务参数失败",0
//开启服务
ADDR_ATStr_MYNETOPEN
	dcb "AT$MYNETOPEN=0\r",0
ADDR_ERRStr_MYNETOPEN
	dcb "远程无线开启服务失败",0
//短信服务没连接前
//读信号没连接2
//AT循环,没连接

	//连接检查
ADDR_ATStr_MYNETOPEN_LINK
	dcb "AT$MYNETOPEN?\r",0
ADDR_ERRStr_MYNETOPEN_LINK
	dcb "远程无线网络被断开",0
	//数据收发
//读取数据
ADDR_ATStr_MYNETREAD
	dcb 0
ADDR_ERRStr_MYNETREAD
	dcb "远程无线读数据失败",0
//发送数据
ADDR_ATStr_MYNETWRITE
	dcb "AT$MYNETWRITE=0,",0
ADDR_ERRStr_MYNETWRITE
	dcb "远程无线发送数据失败",0
//短信服务
	

//HOLD暂停
ADDR_ATStr_HOLD
	dcb 0
//关闭连接
ADDR_ATStr_MYNETCLOSE
	dcb "AT$MYNETCLOSE=0\r",0
ADDR_ERRStr_MYNETCLOSE
	dcb "远程无线关闭连接失败",0
//关机
ADDR_ATStr_MYPOWEROFF
	dcb "AT$MYPOWEROFF\r",0
ADDR_ERRStr_MYPOWEROFF
	dcb "远程无线模块关机失败",0
	
	ALIGN 4	
};





__asm void GPRS_3763_AT_Command_Lib(void)//AT顺序执行库
{
//波特率检查
	dcd AT_AT
	dcd ADDR_ATStr_AT//AT命令字符串地址
	dcd ADDR_ERRStr_AT//错误提示字符串地址
	dcd 4000//AT命令返回第1个字符定时(ms)

//关回显
	dcd AT_ATE0
	dcd ADDR_ATStr_ATE0//AT命令字符串地址
	dcd ADDR_ERRStr_ATE0//错误提示字符串地址
	dcd 1000//AT命令返回第1个字符定时(ms)

//查询远程通信模块类型
	dcd AT_MYTYPE
	dcd ADDR_ATStr_MYTYPE//AT命令字符串地址
	dcd ADDR_ERRStr_MYTYPE//错误提示字符串地址
	dcd 1000//AT命令返回第1个字符定时(ms)

//获取模块软件版本
	dcd AT_MYGMR
	dcd ADDR_ATStr_MYGMR//AT命令字符串地址
	dcd ADDR_ERRStr_MYGMR//错误提示字符串地址
	dcd 1000//AT命令返回第1个字符定时(ms)

//卡检查
	dcd AT_CPIN
	dcd ADDR_ATStr_CPIN//AT命令字符串地址
	dcd ADDR_ERRStr_CPIN//错误提示字符串地址
	dcd 1000//AT命令返回第1个字符定时(ms)

//关主动上报
	dcd AT_MYNETURC
	dcd ADDR_ATStr_MYNETURC//AT命令字符串地址
	dcd ADDR_ERRStr_MYNETURC//错误提示字符串地址
	dcd 1000//AT命令返回第1个字符定时(ms)

//获取SIM卡序列号ICCID
	dcd AT_MYCCID
	dcd ADDR_ATStr_MYCCID//AT命令字符串地址
	dcd ADDR_ERRStr_MYCCID//错误提示字符串地址
	dcd 1000//AT命令返回第1个字符定时(ms)

//查国际移动台标识请求IMSI
	dcd AT_CIMI
	dcd ADDR_ATStr_CIMI//AT命令字符串地址
	dcd ADDR_ERRStr_CIMI//错误提示字符串地址
	dcd 1000//AT命令返回第1个字符定时(ms)

//读取SIM卡服务运营商名称
/*
	dcd AT_CSPN
	dcd ADDR_ATStr_CSPN//AT命令字符串地址
	dcd ADDR_ERRStr_CSPN//错误提示字符串地址
	dcd 1000//AT命令返回第1个字符定时(ms)
*/

//读信号没连接前
	dcd AT_CSQ_NOLINK
	dcd ADDR_ATStr_CSQ_NOLINK//AT命令字符串地址
	dcd ADDR_ERRStr_CSQ_NOLINK//错误提示字符串地址
	dcd 1000//AT命令返回第1个字符定时(ms)

//获取当前网络注册状态
	dcd AT_CREG
	dcd ADDR_ATStr_CREG//AT命令字符串地址
	dcd ADDR_ERRStr_CREG//错误提示字符串地址
	dcd 1000//AT命令返回第1个字符定时(ms)
	
#if (USER/100)!=0//不是电科院测试(1376.3标准无此命令)
	dcd AT_COPS2
	dcd ADDR_ATStr_COPS2//AT命令字符串地址
	dcd ADDR_ERRStr_COPS2//错误提示字符串地址
	dcd 1000//AT命令返回第1个字符定时(ms)

	dcd AT_COPS
	dcd ADDR_ATStr_COPS//AT命令字符串地址
	dcd ADDR_ERRStr_COPS//错误提示字符串地址
	dcd 1000//AT命令返回第1个字符定时(ms)
#endif

//取本机号码
	dcd AT_CNUM
	dcd ADDR_ATStr_CNUM//AT命令字符串地址
	dcd ADDR_ERRStr_CNUM//错误提示字符串地址
	dcd 1000//AT命令返回第1个字符定时(ms)
	
//查询注册网络类型：2G/3G/4G
	dcd AT_SYSINFO
	dcd ADDR_ATStr_SYSINFO//AT命令字符串地址
	dcd ADDR_ERRStr_SYSINFO//错误提示字符串地址
	dcd 1000//AT命令返回第1个字符定时(ms)

//设置APN(上紧接AT_SYSINFO不分开)
	dcd AT_MYNETCON_APN
	dcd ADDR_ATStr_MYNETCON_APN//AT命令字符串地址
	dcd ADDR_ERRStr_MYNETCON_APN//错误提示字符串地址
	dcd 1000//AT命令返回第1个字符定时(ms)
//设置USERPWD:用户名和密码
	dcd AT_MYNETCON_USERPWD
	dcd ADDR_ATStr_MYNETCON_USERPWD//AT命令字符串地址
	dcd ADDR_ERRStr_MYNETCON_USERPWD//错误提示字符串地址
	dcd 1000//AT命令返回第1个字符定时(ms)

//激活网络连接
	dcd AT_MYNETACT
	dcd ADDR_ATStr_MYNETACT//AT命令字符串地址
	dcd ADDR_ERRStr_MYNETACT//错误提示字符串地址
	dcd 90000//AT命令返回第1个字符定时(ms)

//IP访问控制配置
	dcd AT_MYIPFILTER
	dcd ADDR_ATStr_MYIPFILTER//AT命令字符串地址
	dcd ADDR_ERRStr_MYIPFILTER//错误提示字符串地址
	dcd 1000//AT命令返回第1个字符定时(ms)

//设置短消息模式
	dcd AT_CMFG
	dcd ADDR_ATStr_CMFG//AT命令字符串地址
	dcd ADDR_ERRStr_CMFG//错误提示字符串地址
	dcd 1000//AT命令返回第1个字符定时(ms)

//打开短信功能(仅中兴CDMA(MC8332)时需要)
	dcd AT_ZCVF
	dcd ADDR_ATStr_ZCVF//AT命令字符串地址
	dcd ADDR_ERRStr_ZCVF//错误提示字符串地址
	dcd 1000//AT命令返回第1个字符定时(ms)

//休眠等待时间(仅CDMA时需要);无数据传输时经过10秒后CDMA通信模块主动释放空中接口资源
	dcd AT_CTA
	dcd ADDR_ATStr_CTA//AT命令字符串地址
	dcd ADDR_ERRStr_CTA//错误提示字符串地址
	dcd 1000//AT命令返回第1个字符定时(ms)


