gdgly/NUC97X_JS/STM32F4xx/Device/GPRS_3763_back.c
	//没连接循环开始
//设置服务参数
	dcd AT_MYNETSRV
	dcd ADDR_ATStr_MYNETSRV//AT命令字符串地址
	dcd ADDR_ERRStr_MYNETSRV//错误提示字符串地址
	dcd 1000//AT命令返回第1个字符定时(ms)
//开启服务
	dcd AT_MYNETOPEN
	dcd ADDR_ATStr_MYNETOPEN//AT命令字符串地址
	dcd ADDR_ERRStr_MYNETOPEN//错误提示字符串地址
	dcd 90000//AT命令返回第1个字符定时(ms)
//短信服务没连接前
	dcd AT_SMS_NOLINK
	dcd 0//AT命令字符串地址
	dcd 0//错误提示字符串地址
	dcd 6000//AT命令返回第1个字符定时(ms)
//读信号没连接2
	dcd AT_CSQ_NOLINK2
	dcd ADDR_ATStr_CSQ_NOLINK//AT命令字符串地址
	dcd ADDR_ERRStr_CSQ_NOLINK//错误提示字符串地址
	dcd 1000//AT命令返回第1个字符定时(ms)
//AT循环,没连接
	dcd AT_LOOP_NOLINK
	dcd 0//AT命令字符串地址
	dcd 0//错误提示字符串地址
	dcd 0//AT命令返回第1个字符定时(ms)


//读信号连接后
	dcd AT_CSQ_LINK
	dcd ADDR_ATStr_CSQ_NOLINK//AT命令字符串地址
	dcd ADDR_ERRStr_CSQ_NOLINK//错误提示字符串地址
	dcd 1000//AT命令返回第1个字符定时(ms)
//查询注册网络类型：2G/3G/4G
	dcd AT_SYSINFO_LINK
	dcd ADDR_ATStr_SYSINFO//AT命令字符串地址
	dcd ADDR_ERRStr_SYSINFO//错误提示字符串地址
	dcd 1000//AT命令返回第1个字符定时(ms)
//查询网络连接
	dcd AT_MYNETOPEN_LINK
	dcd ADDR_ATStr_MYNETOPEN_LINK//AT命令字符串地址
	dcd ADDR_ERRStr_MYNETOPEN_LINK//错误提示字符串地址
	dcd 1000//AT命令返回第1个字符定时(ms)

//读取数据
	dcd AT_MYNETREAD
	dcd ADDR_ATStr_MYNETREAD//AT命令字符串地址
	dcd ADDR_ERRStr_MYNETREAD//错误提示字符串地址
	dcd 2000//AT命令返回第1个字符定时(ms)
//发送数据
	dcd AT_MYNETWRITE
	dcd ADDR_ATStr_MYNETWRITE//AT命令字符串地址
	dcd ADDR_ERRStr_MYNETWRITE//错误提示字符串地址
	dcd 2000//AT命令返回第1个字符定时(ms)
//FTP文件下载
	dcd AT_MYFTP
	dcd 0//AT命令字符串地址
	dcd 0//错误提示字符串地址
	dcd 40000//AT命令返回第1个字符定时(ms)
//短信服务
	dcd AT_SMS_LINK
	dcd 0//AT命令字符串地址
	dcd 0//错误提示字符串地址
	dcd 6000//AT命令返回第1个字符定时(ms)


//AT循环,在线控制
	dcd AT_LOOP
	dcd 0//AT命令字符串地址
	dcd 0//错误提示字符串地址
	dcd 0//AT命令返回第1个字符定时(ms)




//HOLD暂停
	dcd AT_HOLD
	dcd ADDR_ATStr_HOLD//AT命令字符串地址
	dcd ADDR_ERRStr_ATE0//错误提示字符串地址
	dcd 1000//AT命令返回第1个字符定时(ms)
//关闭连接
	dcd AT_MYNETCLOSE
	dcd ADDR_ATStr_MYNETCLOSE//AT命令字符串地址
	dcd ADDR_ERRStr_MYNETCLOSE//错误提示字符串地址
	dcd 1000//AT命令返回第1个字符定时(ms)
//关机
	dcd AT_MYPOWEROFF
	dcd ADDR_ATStr_MYPOWEROFF//AT命令字符串地址
	dcd ADDR_ERRStr_MYPOWEROFF//错误提示字符串地址
	dcd 1000//AT命令返回第1个字符定时(ms)

};



void GPRS_3763_NextATCount(void)//下1个AT
{
	UART1Ctrl->LinkSubTask=0;//尝试AT发送计数
	UART1Ctrl->SubTask=0;//子任务
	UART1Ctrl->ATCount++;
	//下个AT命令定时设置
	switch(UART1Ctrl->ATCount)//下个AT命令
	{
		case AT_CSQ_NOLINK://读信号没连接前
			Terminal_Ram->GPRSWaitTx_S_Timer=60;//GPRS等待信号强度查询(连接前)定时
			break;
		case AT_CREG://获取当前网络注册状态
			Terminal_Ram->GPRSWaitTx_S_Timer=60;//等待注册定时
			break;
		case AT_SYSINFO_LINK:
		case AT_SYSINFO://查询注册网络类型：2G/3G/4G
			Terminal_Ram->GPRSWaitTx_S_Timer=10;//等待返回正确注册网络类型：2G/3G/4G
			break;
		case AT_MYNETACT://激活网络连接
			Terminal_Ram->GPRSWaitTx_S_Timer=60;//等待激活网络连接定时
			break;
		
	}
}

void LineATIntRx(u32 ADDR_ATIntRx,u32 ADDR_BUFF,u32 Byte)//取AT中断接收数据线性放在缓冲中
{
	u32 i;
	u8 *p8s;
	u8 *p8d;
	
	while(ADDR_ATIntRx>=(ADDR_UART1IntATRx+LEN_UART1IntATRx))
	{
		ADDR_ATIntRx-=(LEN_UART1IntATRx-10);
	}
	p8s=(u8*)(ADDR_ATIntRx);
	p8d=(u8*)(ADDR_BUFF);
	for(i=0;i<Byte;i++)
	{
		p8d[0]=p8s[0];
		p8s++;
		p8d++;
		if(((u32)p8s)>=(ADDR_UART1IntATRx+LEN_UART1IntATRx))
		{
			p8s=(u8*)(ADDR_UART1IntATRx+10);
		}
	}
}


void GPRS_3763_AT_Tx(void)//AT命令发送
{
	u32 i;
	u32 x;
	u32 y;
	u32 n;
	u32 AT_No;
	u32 TxByte;
	u8 *p8;
	u16 *p16;
	u32 *p32;
	u8 *p8rx;
	u8 *p8tx;
	
	u32 FTPFileCount;//FTP文件下载个数计数
	
	n=n;
	p8tx=(u8*)(ADDR_ATTx);
	TxByte=0;
	AT_No=UART1Ctrl->ATCount;//AT计数
	if(AT_No>AT_Max)
	{
		AT_No=0;
		UART1Ctrl->ATCount=0;//AT计数
	}
	p32=(u32*)(&GPRS_3763_AT_Command_Lib);
	switch(p32[4*AT_No])//AT代号
	{
		case AT_AT://波特率检查
			TxByte=CopyString((u8 *)"AT\r",p8tx);//拷贝字符串,字符串ps拷贝到pd,返回拷贝字符串的字节数
			switch(UART1Ctrl->SubTask)//子任务
			{
				case 0://速率57600
					UART1Ctrl->BpsCtrl=0x3+(9<<5);//速率57600
					break;
				case 1://速率115200
					UART1Ctrl->BpsCtrl=0x3+(10<<5);//速率115200
					break;
				case 2://速率38400
					UART1Ctrl->BpsCtrl=0x3+(8<<5);
					break;
				case 3://速率19200
					UART1Ctrl->BpsCtrl=0x3+(7<<5);
					break;
				case 4://速率9600
					UART1Ctrl->BpsCtrl=0x3+(6<<5);
					break;
				case 5://速率4800
					UART1Ctrl->BpsCtrl=0x3+(5<<5);
					break;
				case 6://速率2400
					UART1Ctrl->BpsCtrl=0x3+(4<<5);
					break;
				case 7://速率1200
					UART1Ctrl->BpsCtrl=0x3+(3<<5);
					break;
					
//				case 10://下1个AT
//					GPRS_3763_NextATCount();//不需设置,57.6k可通信
//					return;
				default:
					TxByte=CopyString((u8 *)"AT+IPR=57600\r",p8tx);//拷贝字符串,字符串ps拷贝到pd,返回拷贝字符串的字节数
					break;
			}
			//启动UART1口发送
			Init_UARTn(GPRSPORT);//初始化UART口,入口通信控制字已填入
			UART1Ctrl->TxByte=TxByte;//发送字节数(半字对齐)
			UART1Ctrl->TxCount=0;
		#if LOG_1376_3==1//0=没,1=有
			LOG(13763,1,GPRSPORT,(u8 *)ADDR_ATTx,TxByte,1);//入口:TR=0接收=1发送;protocol=13761,13762,13763,6451997,6452007;ascii=0为hex码=1本身为ascii码
		#endif
		#if DEBUG_GPRStoRS232==1//0=否,1=是;调试:GPRS口收发数据打印到RS232口
			LOGRS232(13763,1,GPRSPORT,(u8 *)ADDR_ATTx,TxByte,1);//入口:TR=0接收=1发送;protocol=13761,13762,13763,6451997,6452007;ascii=0为hex码=1本身为ascii码
		#endif
			Start_UARTn_Tx(GPRSPORT);//启动UART口发送
			UART1Ctrl->ATTask=2;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
			return;
		case AT_CNUM://取本机号码
			TxByte=CopyString((u8 *)p32[(4*AT_No)+1],p8tx);//拷贝字符串,字符串ps拷贝到pd,返回拷贝字符串的字节数
			break;		
		case AT_MYNETCON_APN://设置APN
			TxByte=CopyString((u8 *)p32[(4*AT_No)+1],p8tx);//拷贝字符串,字符串ps拷贝到pd,返回拷贝字符串的字节数
	#if MainProtocol==376
			MR(ADDR_DATABUFF,ADDR_AFN04F3+12,16);
			MC(0,ADDR_DATABUFF+16,1);
	#else
			//DL698
			i=MRR(ADDR_4520_2+1,1);//取备用通道数
			if(i==0)
			{//备用通道数=0
				p8=Get_Element((u8 *)ADDR_4500_2,6,0,LENmax_4500_2);//计算元素地址,使用ADDR_128KDATABUFF
				if(p8)
				{//找到
					i=p8[1];//字节数
					p8+=2;
					p8[i]=0;
					MR(ADDR_DATABUFF,(u32)p8,i+1);
				}
				else
				{//没找到
					CopyString((u8 *)"cmnet\x0",(u8 *)ADDR_DATABUFF);//拷贝字符串,字符串ps拷贝到pd,返回拷贝字符串的字节数
				}
			}
			else
			{//有备用通道数
				MR(ADDR_128KDATABUFF,ADDR_4520_2,LENmax_4520_2);
				p8=(u8*)ADDR_128KDATABUFF;
				x=p8[1];//取备用通道数
				i=Comm_Ram->CSPN;//0=空,1=中国移动通信-----china mobile  CMCC,2=中国联通通讯-----china unicom  CUCC,3=中国电信  ------CHINA TELECOM  CTCC		
				switch(i)
				{
					default:
					case 1://1=中国移动通信-----china mobile  CMCC
						n=0;//CMCC（移动） = 0，CTCC（电信） = 1，CUCC（联通） = 2
						break;
					case 2://2=中国联通通讯-----china unicom  CUCC
						n=2;//CMCC（移动） = 0，CTCC（电信） = 1，CUCC（联通） = 2
						break;
					case 3://3=中国电信  ------CHINA TELECOM  CTCC	
						n=1;//CMCC（移动） = 0，CTCC（电信） = 1，CUCC（联通） = 2
						break;
				}
				p8+=2;
				for(i=0;i<x;i++)
				{
					if(p8[3]==n)//CMCC（移动） = 0，CTCC（电信） = 1，CUCC（联通） = 2
					{
						y=p8[5];//2G = 0，3G = 1， 4G = 2， 未知 = 255 ， 
						y+=2;
						if(y==Comm_Ram->RemoteWirelessModuleSYSINFO)//远程无线模块当前注册的网络:0=No service,1=,2=2G(GPRS,CDMA),3=3G(WCDMA,TD-SCDMA,CDMA EVD0),4=4G(FDD-LTE,TDD-LTE)
						{
							break;
						}
					}
					p8+=Get_DL698DataLen_S(p8,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:长度
				}
				if(i<x)
				{//找到
					p8+=6;
					i=p8[1];//字节数
					p8+=2;
					p8[i]=0;
					MR(ADDR_DATABUFF,(u32)p8,i+1);
				}
				else
				{
					CopyString((u8 *)"cmnet\x0",(u8 *)ADDR_DATABUFF);//拷贝字符串,字符串ps拷贝到pd,返回拷贝字符串的字节数
				}
			}
	#endif
			TxByte+=CopyString((u8 *)ADDR_DATABUFF,p8tx+TxByte);//拷贝字符串,字符串ps拷贝到pd,返回拷贝字符串的字节数
			p8tx[TxByte]='"';
			TxByte++;
			p8tx[TxByte]='\r';
			TxByte++;
			break;
		case AT_MYNETCON_USERPWD://设置USERPWD:用户名和密码
			//AT$MYNETCON=0,"USERPWD","card,card"
		#if (USER/100)==14//福建
			#if MainProtocol==376
				MR(ADDR_DATABUFF,ADDR_AFN04F3+12,16);
				p8=(u8*)(ADDR_DATABUFF);
				if(((p8[0]!='f')&&(p8[0]!='F'))
				|| ((p8[1]!='j')&&(p8[1]!='J'))
				|| ((p8[2]!='e')&&(p8[2]!='E'))
				|| ((p8[3]!='p')&&(p8[3]!='P'))
				|| (p8[4]!='.')
				|| ((p8[5]!='f')&&(p8[4]!='F'))
				|| ((p8[6]!='j')&&(p8[6]!='J')))
				{//非特定APN，用户名密码采取AFN04F16设置值
				}
				else
				{
					TxByte=CopyString((u8 *)p32[(4*AT_No)+1],p8tx);//拷贝字符串,字符串ps拷贝到pd,返回拷贝字符串的字节数
					MR(ADDR_DATABUFF,ADDR_AFN0CF1+4,12);//设备编号
					p8[12]=0;//字符串结尾
					//用户名
					TxByte+=CopyString((u8 *)ADDR_DATABUFF,p8tx+TxByte);//拷贝字符串,字符串ps拷贝到pd,返回拷贝字符串的字节数
					TxByte+=CopyString((u8 *)"@fjep.vpdn.fj",p8tx+TxByte);//拷贝字符串,字符串ps拷贝到pd,返回拷贝字符串的字节数
					p8tx[TxByte++]=',';
					//密码
					for(i=0;i<12;i++)
					{//倒序拷贝
						p8tx[TxByte+i]=p8[11-i];
					}
					TxByte+=12;
					p8tx[TxByte]='"';
					TxByte++;
					p8tx[TxByte]='\r';
					TxByte++;
					break;
				}
			#endif
			#if MainProtocol==698
				#warning "福建需另做"
			#endif
		#endif
			TxByte=CopyString((u8 *)p32[(4*AT_No)+1],p8tx);//拷贝字符串,字符串ps拷贝到pd,返回拷贝字符串的字节数
	#if MainProtocol==376
			if(MRR(ADDR_AFN04F16,1)!=0)
			{
				MR(ADDR_DATABUFF,ADDR_AFN04F16,32);
				MC(0,ADDR_DATABUFF+32,1);
				TxByte+=CopyString((u8 *)ADDR_DATABUFF,p8tx+TxByte);//拷贝字符串,字符串ps拷贝到pd,返回拷贝字符串的字节数
				p8tx[TxByte]=',';
				TxByte++;
				MR(ADDR_DATABUFF,ADDR_AFN04F16+32,32);
				TxByte+=CopyString((u8 *)ADDR_DATABUFF,p8tx+TxByte);//拷贝字符串,字符串ps拷贝到pd,返回拷贝字符串的字节数
			}
			else
			{//用户名和密码均为空,分二种命令,有','号和无','号
				if(UART1Ctrl->LinkSubTask>=2)//尝试AT发送计数
				{
					p8tx[TxByte]=',';
					TxByte++;
				}
			}
	#else
			//DL698
			i=MRR(ADDR_4520_2+1,1);//取备用通道数
			if(i==0)
			{//备用通道数=0
				p8=Get_Element((u8 *)ADDR_4500_2,7,0,LENmax_4500_2);//计算元素地址,使用ADDR_128KDATABUFF
				if(p8)
				{//找到
					i=p8[1];//字节数
					p8+=2;
					p8[i]=0;
					TxByte+=CopyString(p8,p8tx+TxByte);//拷贝字符串,字符串ps拷贝到pd,返回拷贝字符串的字节数
					p8tx[TxByte]=',';
					TxByte++;
					p8=Get_Element((u8 *)ADDR_4500_2,8,0,LENmax_4500_2);//计算元素地址,使用ADDR_128KDATABUFF
					if(p8)
					{//找到
						i=p8[1];//字节数
						p8+=2;
						p8[i]=0;
						TxByte+=CopyString(p8,p8tx+TxByte);//拷贝字符串,字符串ps拷贝到pd,返回拷贝字符串的字节数
					}
				}
				else
				{//没找到;用户名和密码均为空,分二种命令,有','号和无','号
					if(UART1Ctrl->LinkSubTask>=2)//尝试AT发送计数
					{
						p8tx[TxByte]=',';
						TxByte++;
					}
				}
			}
			else
			{//有备用通道数
				MR(ADDR_128KDATABUFF,ADDR_4520_2,LENmax_4520_2);
				p8=(u8*)ADDR_128KDATABUFF;
				x=p8[1];//取备用通道数
				i=Comm_Ram->CSPN;//0=空,1=中国移动通信-----china mobile  CMCC,2=中国联通通讯-----china unicom  CUCC,3=中国电信  ------CHINA TELECOM  CTCC		
				switch(i)
				{
					default:
					case 1://1=中国移动通信-----china mobile  CMCC
						n=0;//CMCC（移动） = 0，CTCC（电信） = 1，CUCC（联通） = 2
						break;
					case 2://2=中国联通通讯-----china unicom  CUCC
						n=2;//CMCC（移动） = 0，CTCC（电信） = 1，CUCC（联通） = 2
						break;
					case 3://3=中国电信  ------CHINA TELECOM  CTCC	
						n=1;//CMCC（移动） = 0，CTCC（电信） = 1，CUCC（联通） = 2
						break;
				}
				p8+=2;
				for(i=0;i<x;i++)
				{
					if(p8[3]==n)//CMCC（移动） = 0，CTCC（电信） = 1，CUCC（联通） = 2
					{
						y=p8[5];//2G = 0，3G = 1， 4G = 2， 未知 = 255 ， 
						y+=2;
						if(y==Comm_Ram->RemoteWirelessModuleSYSINFO)//远程无线模块当前注册的网络:0=No service,1=,2=2G(GPRS,CDMA),3=3G(WCDMA,TD-SCDMA,CDMA EVD0),4=4G(FDD-LTE,TDD-LTE)
						{
							break;
						}
					}
					p8+=Get_DL698DataLen_S(p8,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:长度
				}
				if(i<x)
				{//找到
					p8+=6;
					p8+=Get_DL698DataLen_S(p8,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:长度
					//用户名
					if(p8[0]==DataType_visible_string)
					{
						i=p8[1];//字节数
						p8+=2;
						MR(ADDR_DATABUFF,(u32)p8,i);
						MC(0,ADDR_DATABUFF+i,1);
						TxByte+=CopyString((u8*)ADDR_DATABUFF,p8tx+TxByte);//拷贝字符串,字符串ps拷贝到pd,返回拷贝字符串的字节数
						p8+=i;
						//密码
						p8tx[TxByte]=',';
						TxByte++;
						if(p8[0]==DataType_visible_string)
						{
							i=p8[1];//字节数
							p8+=2;
							MR(ADDR_DATABUFF,(u32)p8,i);
							MC(0,ADDR_DATABUFF+i,1);
							TxByte+=CopyString((u8*)ADDR_DATABUFF,p8tx+TxByte);//拷贝字符串,字符串ps拷贝到pd,返回拷贝字符串的字节数
						}
					}
					else
					{//没找到;用户名和密码均为空,分二种命令,有','号和无','号
						if(UART1Ctrl->LinkSubTask>=2)//尝试AT发送计数
						{
							p8tx[TxByte]=',';
							TxByte++;
						}
					}
				}
				else
				{//没找到;用户名和密码均为空,分二种命令,有','号和无','号
					if(UART1Ctrl->LinkSubTask>=2)//尝试AT发送计数
					{
						p8tx[TxByte]=',';
						TxByte++;
					}
				}
			}
	#endif
			p8tx[TxByte]='"';
			TxByte++;
			p8tx[TxByte]='\r';
			TxByte++;
			break;
		case AT_MYIPFILTER://IP访问控制配置
			if(UART1Ctrl->SubTask>=5)
			{
				GPRS_3763_NextATCount();//下1个AT
				return;
			}
	#if MainProtocol==376
			TxByte=CopyString((u8 *)p32[(4*AT_No)+1],p8tx);//拷贝字符串,字符串ps拷贝到pd,返回拷贝字符串的字节数
			x=MRR(ADDR_IPFILTER+(4*UART1Ctrl->SubTask),4);
			if(x==0)
			{
				UART1Ctrl->SubTask++;//子任计数
				return;
			}
			p8tx[TxByte]='"';
			TxByte++;
			for(i=0;i<4;i++)
			{
				y=hex_bcd(x&0xff);//HEX数转为8位压缩BCD数
				x>>=8;
				TxByte+=BCD_ASCII(y,((u32)p8tx)+TxByte);//BCD转为ASCII码存在Addr存贮单元,不显无效0,返回有效ASCII字符数
				p8tx[TxByte]='.';
				TxByte++;
			}
			TxByte--;//IP第4个字节的'.'删去
			p8tx[TxByte]='"';
			TxByte++;
			p8tx[TxByte]=',';
			TxByte++;
			p8tx[TxByte]='"';
			TxByte++;
			TxByte+=CopyString((u8 *)"255.255.255.255",p8tx+TxByte);//拷贝字符串,字符串ps拷贝到pd,返回拷贝字符串的字节数
			p8tx[TxByte]='"';
			TxByte++;
			p8tx[TxByte]='\r';
			TxByte++;
			break;
	#else
			GPRS_3763_NextATCount();//下1个AT
			return;
	#endif
			
	#if (USER/100)==0//用户标识,电科院测试不发短信AT
		case AT_CMFG://设置短消息模式
		case AT_ZCVF://打开短信功能(仅中兴CDMA(MC8332)时需要)
		case AT_CTA://休眠等待时间(仅CDMA时需要);无数据传输时经过10秒后CDMA通信模块主动释放空中接口资源
			GPRS_3763_NextATCount();//下1个AT
			return;
	#else
		#if (USER/100)==14//福建系
		case AT_ZCVF://打开短信功能(仅中兴CDMA(MC8332)时需要)
//		case AT_CTA://休眠等待时间(仅CDMA时需要);无数据传输时经过10秒后CDMA通信模块主动释放空中接口资源
			GPRS_3763_NextATCount();//下1个AT
			return;
		#else
		case AT_ZCVF://打开短信功能(仅中兴CDMA(MC8332)时需要)
		case AT_CTA://休眠等待时间(仅CDMA时需要);无数据传输时经过10秒后CDMA通信模块主动释放空中接口资源
			GPRS_3763_NextATCount();//下1个AT
			return;
		#endif//(USER/100)==14//福建系
	#endif
	
		case AT_MYNETSRV://设置服务参数
			switch(UART1Ctrl->SubTask)//子任务
			{
				case 0://确定工作模式
			#if MainProtocol==376
					i=MRR(ADDR_AFN04F8,1);//原工作模式(同F8设置字)B7=0TCP=1UDP,B6=,B5-B4=0混合模式=1客户机模式=2服务器模式,B3-B0=其它;
			#else
				//DL698
				//通信配置∷=structure
				//工作模式  enum{混合模式（0），客户机模式（1），服务器模式（2）}，
				//在线方式      enum{永久在线（0），被动激活（1）}，
				//连接方式      enum{TCP（0），UDP（1）}，
				//连接应用方式  enum{主备模式（0），多连接模式（1）}，
					MR(ADDR_128KDATABUFF,ADDR_4500_2+2,6);
					p8=(u8*)ADDR_128KDATABUFF;
					i=p8[1]<<4;//B5-B4=0混合模式=1客户机模式=2服务器模式
					i|=p8[5]<<7;//B7=0TCP=1UDP
			#endif
					UART1Ctrl->TCPUDP=i;
					i&=0x30;
					if(UART1Ctrl->TCPUDP&0x80)
					{//UDP
						if(i==0x20)
						{//=2服务器模式
							UART1Ctrl->SubTask=4;
						}
						else
						{//=0混合模式=1客户机模式
							UART1Ctrl->SubTask=3;
						}
					}
					else
					{//TCP
						if(i==0x20)
						{//=2服务器模式
							UART1Ctrl->SubTask=2;
						}
						else
						{//=0混合模式=1客户机模式
							UART1Ctrl->SubTask=1;
						}
					}
					return;
				//case 1://TCP客户机模式
				default://TCP客户机模式
					//AT$MYNETSRV=0,0,0,0,"172.22.33.2:5000" 
					TxByte=CopyString((u8 *)"AT$MYNETSRV=0,0,0,0,",p8tx);//拷贝字符串,字符串ps拷贝到pd,返回拷贝字符串的字节数
				TCPClient:
					p8tx[TxByte]='"';
					TxByte+=1;
					UART1Ctrl->LinkCount++;
			#if MainProtocol==376
					if(UART1Ctrl->LinkCount>=4)
					{
						UART1Ctrl->LinkCount=0;
					}
					if(UART1Ctrl->LinkCount<=2)
					{//主ip
						MR(ADDR_DATABUFF,ADDR_AFN04F3,6);
					}
					else
					{//备用ip
						MR(ADDR_DATABUFF,ADDR_AFN04F3+6,6);
					}
			#else
					//DL698
					i=MRR(ADDR_4520_2+1,1);//取备用通道数
					if(i==0)
					{//备用通道数=0
						if(UART1Ctrl->LinkCount>=4)
						{
							UART1Ctrl->LinkCount=0;
						}
						i=MRR(ADDR_4500_3+1,1);
						if((UART1Ctrl->LinkCount<=2)||(i<2))
						{//主ip
							p8=Get_Element((u8*)ADDR_4500_3,1,1,LENmax_4500_3);//计算元素地址,使用ADDR_128KDATABUFF
							if(p8)
							{
								MR(ADDR_DATABUFF,(u32)p8+2,4);
								p8=Get_Element((u8*)ADDR_4500_3,1,2,LENmax_4500_3);//计算元素地址,使用ADDR_128KDATABUFF
								if(p8)
								{
									i=p8[1]<<8;
									i|=p8[2];
									p8=(u8*)(ADDR_DATABUFF);
									p8[4]=i;
									p8[5]=i>>8;
								}
							}
						}
						else
						{//备用ip
							p8=Get_Element((u8*)ADDR_4500_3,2,1,LENmax_4500_3);//计算元素地址,使用ADDR_128KDATABUFF
							if(p8)
							{
								MR(ADDR_DATABUFF,(u32)p8+2,4);
								p8=Get_Element((u8*)ADDR_4500_3,2,2,LENmax_4500_3);//计算元素地址,使用ADDR_128KDATABUFF
								if(p8)
								{
									i=p8[1]<<8;
									i|=p8[2];
									p8=(u8*)(ADDR_DATABUFF);
									p8[4]=i;
									p8[5]=i>>8;
								}
							}
						}
					}
					else
					{//有备用通道数
						MR(ADDR_128KDATABUFF,ADDR_4520_2,LENmax_4520_2);
						p8=(u8*)ADDR_128KDATABUFF;
						x=p8[1];//取备用通道数
						i=Comm_Ram->CSPN;//0=空,1=中国移动通信-----china mobile  CMCC,2=中国联通通讯-----china unicom  CUCC,3=中国电信  ------CHINA TELECOM  CTCC		
						switch(i)
						{
							default:
							case 1://1=中国移动通信-----china mobile  CMCC
								n=0;//CMCC（移动） = 0，CTCC（电信） = 1，CUCC（联通） = 2
								break;
							case 2://2=中国联通通讯-----china unicom  CUCC
								n=2;//CMCC（移动） = 0，CTCC（电信） = 1，CUCC（联通） = 2
								break;
							case 3://3=中国电信  ------CHINA TELECOM  CTCC	
								n=1;//CMCC（移动） = 0，CTCC（电信） = 1，CUCC（联通） = 2
								break;
						}
						p8+=2;
						for(i=0;i<x;i++)
						{
							if(p8[3]==n)//CMCC（移动） = 0，CTCC（电信） = 1，CUCC（联通） = 2
							{
								y=p8[5];//2G = 0，3G = 1， 4G = 2， 未知 = 255 ， 
								y+=2;
								if(y==Comm_Ram->RemoteWirelessModuleSYSINFO)//远程无线模块当前注册的网络:0=No service,1=,2=2G(GPRS,CDMA),3=3G(WCDMA,TD-SCDMA,CDMA EVD0),4=4G(FDD-LTE,TDD-LTE)
								{
									break;
								}
							}
							p8+=Get_DL698DataLen_S(p8,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:长度
						}
						MC(0,ADDR_DATABUFF,6);
						if(i<x)
						{//找到
							if(UART1Ctrl->LinkCount>=4)
							{
								UART1Ctrl->LinkCount=0;
							}
							p8=Get_Element(p8,8,0,0);//计算元素地址,使用ADDR_128KDATABUFF
							if(p8)
							{
								i=p8[1];//主站通信参数 array数
								if((UART1Ctrl->LinkCount<=2)||(i<2))
								{//主ip
									p8+=2;
									MR(ADDR_DATABUFF,(u32)p8+4,4);
									p8=Get_Element(p8,2,0,0);//计算元素地址,使用ADDR_128KDATABUFF
									if(p8)
									{
										i=p8[1]<<8;
										i|=p8[2];
										p8=(u8*)(ADDR_DATABUFF);
										p8[4]=i;
										p8[5]=i>>8;
									}
								}
								else
								{//备用ip
									p8=Get_Element(p8,2,0,0);//计算元素地址,使用ADDR_128KDATABUFF
									if(p8)
									{
										p8+=2;
										MR(ADDR_DATABUFF,(u32)p8+4,4);
										p8=Get_Element(p8,2,0,0);//计算元素地址,使用ADDR_128KDATABUFF
										if(p8)
										{
											i=p8[1]<<8;
											i|=p8[2];
											p8=(u8*)(ADDR_DATABUFF);
											p8[4]=i;
											p8[5]=i>>8;
										}
									}
								}
							}
						}
					}
			#endif
					p8=(u8*)(ADDR_DATABUFF);
					for(i=0;i<4;i++)
					{
						y=hex_bcd(p8[i]);//HEX数转为8位压缩BCD数
						TxByte+=BCD_ASCII(y,((u32)p8tx)+TxByte);//BCD转为ASCII码存在Addr存贮单元,不显无效0,返回有效ASCII字符数
						p8tx[TxByte]='.';
						TxByte++;
					}
					TxByte--;//IP第4个字节的'.'删去
					//目的端口号
					p8tx[TxByte]=':';
					TxByte+=1;
					y=hex_bcd(p8[4]+(p8[5]<<8));//HEX数转为8位压缩BCD数
					TxByte+=BCD_ASCII(y,((u32)p8tx)+TxByte);//BCD转为ASCII码存在Addr存贮单元,不显无效0,返回有效ASCII字符数
					p8tx[TxByte]='"';
					TxByte++;
					p8tx[TxByte]='\r';
					TxByte++;
					break;
				case 2://TCP服务器模式
					TxByte=CopyString((u8 *)"AT$MYNETSRV=0,0,1,0,",p8tx);//拷贝字符串,字符串ps拷贝到pd,返回拷贝字符串的字节数
					p8tx[TxByte]='"';
					TxByte++;
					TxByte+=CopyString((u8 *)"127.0.0.1",p8tx+TxByte);//拷贝字符串,字符串ps拷贝到pd,返回拷贝字符串的字节数
					p8tx[TxByte]=':';
					TxByte+=1;
					//服务器模式,端口号用设定
			#if MainProtocol==376
					i=MRR(ADDR_AFN04F7+20,1);//终端侦听端口 BIN 2
					i+=(20+1);
					i+=(1+MRR(ADDR_AFN04F7+i,1));
					i=MRR(ADDR_AFN04F7+i,2);
					i=hex_bcd(i);//HEX数转为8位压缩BCD数
			#else
//#define ADDR_4500_2     ADDR_4003+LENmax_4003//公网通信模块1;2通信配置
//通信配置∷=structure
//{
//工作模式  enum{混合模式（0），客户机模式（1），服务器模式（2）}，
//在线方式      enum{永久在线（0），被动激活（1）}，
//连接方式      enum{TCP（0），UDP（1）}，
//连接应用方式  enum{主备模式（0），多连接模式（1）}，
//侦听端口列表  array long-unsigned，
//APN            visible-string，
//用户名         visible-string，
//密码           visible-string，
//代理服务器地址 octet-string，
//代理端口            long-unsigned，
//超时时间及重发次数  bit-string(SIZE(8))
//（
//bit7~bit2：超时时间（秒），
//bit1~bit0：重发次数
//），
//心跳周期(秒)  long-unsigned
//}
					i=MRR(ADDR_4500_2+12,2);
					i=(i>>8)+((i&0xff)<<8);
					i=hex_bcd(i);//HEX数转为8位压缩BCD数
			#endif
					TxByte+=BCD_ASCII(i,((u32)p8tx)+TxByte);//BCD转为ASCII码存在Addr存贮单元,不显无效0,返回有效ASCII字符数
					p8tx[TxByte]='"';
					TxByte++;
					p8tx[TxByte]='\r';
					TxByte++;
					break;
				case 3://UDP客户机模式
					TxByte=CopyString((u8 *)"AT$MYNETSRV=0,0,2,0,",p8tx);//拷贝字符串,字符串ps拷贝到pd,返回拷贝字符串的字节数
					goto TCPClient;
				case 4://UDP服务器模式
					//无此模式
					WarningOccur(GPRSPORT,(u8 *)"远程无线上行模式错");//告警发生,入口告警代码和告警字符串
					TxByte=CopyString((u8 *)"AT$MYNETSRV=0,0,0,0,",p8tx);//拷贝字符串,字符串ps拷贝到pd,返回拷贝字符串的字节数
					goto TCPClient;
			}
			break;
		case AT_MYNETOPEN://开启服务
			if(UART1Ctrl->LinkCtrl==0)//连接控制0=不连接,1=连接
			{
				GPRS_3763_NextATCount();//下1个AT
			}
			else
			{
		#if MainProtocol==376
				i=MRR(ADDR_AFN04F8,1);
				i&=0x3;
				if(i==2)
				{//被动激活模式
					if(UART1Ctrl->ReLinkNum==0)//被动激活模式重拨次数,收到被动激活命令时置初值
					{//被动激活模式重拨次数=0;
						i=MRR(ADDR_AFN05F38,1);
						if(i!=0x0)
						{
							MC(0,ADDR_AFN05F38,1);//连续无通信自动断线清除激活命令0x55(0x5a)
						}
						GPRS_3763_NextATCount();//下1个AT
						break;
					}
					UART1Ctrl->ReLinkNum--;//被动激活模式重拨次数,收到被动激活命令时置初值
				}
				else
				{//永久在线模式,时段在线模式
					if(Terminal_Ram->GPRSReConnection_S_Timer!=0x0)//7 GPRS永久在线、时段在线模式重拨间隔秒定时器
					{
						WarningOccur(GPRSPORT,(u8 *)"远程无线重拨间隔定时");//告警发生,入口告警代码和告警字符串
						GPRS_3763_NextATCount();//下1个AT
						break;
					}
					//每次登录失败后，经过心跳周期0.5-1.5倍的随机延时（以秒或毫秒计）后重新登录
				#if (USER/100)==13//黑龙江专变
					Terminal_Ram->GPRSReConnection_S_Timer=0;//7 GPRS永久在线、时段在线模式重拨间隔秒定时器
				#else
					i=MRR(ADDR_AFN04F8+1,2);//永久在线、时段在线模式重拨间隔 BIN 秒 2
					Terminal_Ram->GPRSReConnection_S_Timer=i;//7 GPRS永久在线、时段在线模式重拨间隔秒定时器
				#endif
				}
		#else
				//698.45
				
				
		#endif
				TxByte=CopyString((u8 *)p32[(4*AT_No)+1],p8tx);//拷贝字符串,字符串ps拷贝到pd,返回拷贝字符串的字节数
				Terminal_Ram->GPRSWaitConnection_S_Timer=90;//20 GPRS发起连接服务等待秒定时器
				UART1Ctrl->NETOPENCount++;//开启服务次数计数(当前次数达到x次时关模块电源)
			}
			break;

