gdgly/NUC97X_JS/STM32F4xx/Device/GPRS_3763_back.c
		case AT_LOOP_NOLINK://AT循环,没连接
			UART1Ctrl->LinkSubTask=0;//尝试AT发送计数
			UART1Ctrl->SubTask=0;//子任务
		#if (USER/100)==13//黑龙江专变
			if(UART1Ctrl->NETOPENCount>=5)//开启服务连续次数计数(当前次数达到x次时关模块电源)
		#else
			if(UART1Ctrl->NETOPENCount>=3)//开启服务连续次数计数(当前次数达到x次时关模块电源)
		#endif
			{
				UART1Ctrl->NETOPENCount=0;//开启服务连续次数计数(当前次数达到x次时关模块电源)
				UART1Ctrl->ATCount=AT_MYPOWEROFF;//关机
			}
			else
			{
				if(UART1Ctrl->LINKCHECK_RTCS!=Comm_Ram->RTCBuff[0])//在线检查,每秒检查1次(GPRS模块：读信号和打开查询)
				{
					UART1Ctrl->LINKCHECK_RTCS=Comm_Ram->RTCBuff[0];
					x=0;//要重新发起连接标志
			#if MainProtocol==376
					i=MRR(ADDR_AFN04F8,1);
					i&=0x3;
			#else
					i=0;
					
			#endif
					if(i==2)
					{//被动激活模式
						if(UART1Ctrl->ReLinkNum!=0)//被动激活模式重拨次数,收到被动激活命令时置初值
						{//被动激活模式重拨次数=0;
							x=1;//要重新发起连接标志
						}
					}
					else
					{//永久在线模式,时段在线模式
						if(Terminal_Ram->GPRSReConnection_S_Timer==0x0)//7 GPRS永久在线、时段在线模式重拨间隔秒定时器
						{
							x=1;//要重新发起连接标志
						}
					}
					UART1Ctrl->LinkSubTask=0;//尝试AT发送计数
					UART1Ctrl->SubTask=0;//子任务
					if(x==0)//要重新发起连接标志
					{
						UART1Ctrl->ATCount=AT_SMS_NOLINK;//短信服务没连接前
					}
					else
					{
						UART1Ctrl->ATCount=AT_MYNETSRV;//设置服务参数
					}
				}
			}
			break;
		
		
		case AT_CSQ_LINK://读信号连接后(每秒1次)
			if(UART1Ctrl->LINKCHECK_RTCS!=Comm_Ram->RTCBuff[0])//在线检查,每秒检查1次(GPRS模块：读信号和打开查询)
			{
				TxByte=CopyString((u8 *)p32[(4*AT_No)+1],p8tx);//拷贝字符串,字符串ps拷贝到pd,返回拷贝字符串的字节数
			}
			else
			{
				GPRS_3763_NextATCount();//下1个AT
				return;
			}
			break;
		case AT_SYSINFO:
		case AT_SYSINFO_LINK://
	#if MainProtocol==376
		#if (USER/100)!=0//不是电科院送检
			if(UART1Ctrl->LINKCHECK_RTCS!=Comm_Ram->TYMDHMS[0])//
			{
				TxByte=CopyString((u8 *)p32[(4*AT_No)+1],p8tx);//
			}
			else
			{
				GPRS_3763_NextATCount();//??1??AT
				return;
			}
			break;
		#else
			GPRS_3763_NextATCount();//??1??AT
			return;
		#endif
	#endif
	#if MainProtocol==698
		#if (USER/100)!=0//不是电科院送检
			if(UART1Ctrl->LINKCHECK_RTCS!=Comm_Ram->RTCBuff[0])
			{
				TxByte=CopyString((u8 *)p32[(4*AT_No)+1],p8tx);
			}
			else
			{
				GPRS_3763_NextATCount();//??1??AT
				return;
			}
			break;
		#else
			GPRS_3763_NextATCount();//??1??AT
			break;
		#endif
	#endif
		case AT_MYNETOPEN_LINK://连接检查(每秒1次)
			if(UART1Ctrl->LINKCHECK_RTCS!=Comm_Ram->RTCBuff[0])//在线检查,每秒检查1次(GPRS模块：读信号和打开查询)
			{
				UART1Ctrl->LINKCHECK_RTCS=Comm_Ram->RTCBuff[0];
				TxByte=CopyString((u8 *)p32[(4*AT_No)+1],p8tx);//拷贝字符串,字符串ps拷贝到pd,返回拷贝字符串的字节数
			}
			else
			{
				GPRS_3763_NextATCount();//下1个AT
				return;
			}
			break;
		case AT_MYNETREAD://读取数据
			p16=(u16*)(ADDR_UART1IntRx);
			if(p16[0]!=p16[1])
			{
				UART1Ctrl->ATTask=0;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
			#if MainProtocol==698
				Uart_698_RxTx(GPRSPORT);//UART_3761接收发送
			#else
				Uart_3761_RxTx(GPRSPORT);//UART_3761接收发送
			#endif
				return;
			}
			else
			{
				TxByte=CopyString((u8 *)"AT$MYNETREAD=0,",p8tx);//拷贝字符串,字符串ps拷贝到pd,返回拷贝字符串的字节数
				//i=LEN_UART1IntATRx-1024;
				i=1460;
				i=hex_bcd(i);//HEX数转为8位压缩BCD数
				TxByte+=BCD_ASCII(i,((u32)p8tx)+TxByte);//BCD转为ASCII码存在Addr存贮单元,不显无效0,返回有效ASCII字符数
				p8tx[TxByte]='\r';
				TxByte++;
			}
			break;
		case AT_MYNETWRITE://发送数据
			switch(UART1Ctrl->ATWriteTask)//AT数据发送任务:0=发命令,1=发数据
			{
				case 0://发AT头
					TxByte=CopyString((u8 *)p32[(4*AT_No)+1],p8tx);//拷贝字符串,字符串ps拷贝到pd,返回拷贝字符串的字节数
					i=Terminal_Ram->CopyTxByte;//还需发送字节数
					if(i==0)
					{//还需发送字节数错误
						if(UART1Ctrl->Task==6)//6=多帧数据正在发送
						{
						#if MainProtocol==376
							UART1Ctrl->Task=4;//4=多帧数据续接收完成
						#else
							UART1Ctrl->Task=0;
						#endif
						}
						else
						{
							UART1Ctrl->Task=0;//0=接收
						}
						UART1Ctrl->ATTask=0;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
						GPRS_3763_NextATCount();//下1个AT
						return;
					}
					if(i>1460)
					{
						i=1460;
					}
					i=hex_bcd(i);
					TxByte+=BCD_ASCII(i,((u32)p8tx)+TxByte);//BCD转为ASCII码存在Addr存贮单元,不显无效0,返回有效ASCII字符数
					p8tx[TxByte]='\r';
					TxByte++;
					break;
				case 1://发数据
					i=Terminal_Ram->ReqTxByte;
					x=Terminal_Ram->CopyTxByte;
					y=Terminal_Ram->CopyTxCount;
					if((i>LEN_UART1Tx)||(i>x)||(i==0))
					{//可发送长度错误,放弃本帧
						UART1Ctrl->ATTask=0;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
						UART1Ctrl->Task=7;//0=接收
						GPRS_3763_NextATCount();//下1个AT
						return;
					}
					Terminal_Ram->CopyTxByte=x-i;//还需发送字节
					Terminal_Ram->CopyTxCount=y+i;//已发送计数
					
					UART1Ctrl->TxByte=i;
			    UART1Ctrl->TxCount=LEN_ATTx+y;
				#if LOG_1376_3==1//0=没,1=有
					LOG(13763,1,GPRSPORT,(u8 *)ADDR_ATTx+LEN_ATTx+y,i,0);//入口:TR=0接收=1发送;protocol=13761,13762,13763,6451997,6452007;ascii=0为hex码=1本身为ascii码
				#endif
				#if DEBUG_GPRStoRS232==1//0=否,1=是;调试:GPRS口收发数据打印到RS232口
					LOGRS232(13763,1,GPRSPORT,(u8 *)ADDR_ATTx+LEN_ATTx+y,i,0);//入口:TR=0接收=1发送;protocol=13761,13762,13763,6451997,6452007;ascii=0为hex码=1本身为ascii码
				#endif
					
					Start_UARTn_Tx(GPRSPORT);//启动UART口发送
					
					x=MRR((u32)&UART1Ctrl->RxTxByte,4);
					x+=i;
					MWR(x,(u32)&UART1Ctrl->RxTxByte,4);//通信流量
					UART1Ctrl->ATTask=2;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
					return;
				default:
					UART1Ctrl->ATWriteTask=0;//AT数据发送任务:0=发命令,1=发数据
					break;
			}
			break;
		case AT_MYFTP://FTP文件下载
			if(UART1Ctrl->LinkTask!=101)//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
			{
				GPRS_3763_NextATCount();//下1个AT
				return;
			}
		//FTP错误标志:0=空,1=FTP服务器无法登录,2=找不到指定文件目录
		//下载完成
			FTPFileCount=MRR(ADDR_FTPFileFlags+4,1);//下载文件计数;0-x,=MaxFileNum关FTP,=(MaxFileNum+1)返回帧,=(MaxFileNum+2)下载完成显示,=(MaxFileNum+3)结束下载显示
			if(FTPFileCount>(MaxFileNum+1))//最大下载文件个数
			{
				UART1Ctrl->LinkTask2=0;//通道2链接任务(FTP命令)
				UART1Ctrl->FTPLinkCount=0;//FTP尝试连接计数
				UART1Ctrl->FTPErr=0;//FTP错误标志:0=空,1=FTP服务器无法登录,2=找不到指定文件目录
				GPRS_3763_NextATCount();//下1个AT
				return;
			}
			Comm_Ram->DisplayAllErrorTimer=10;//FTP文件下载显示秒定时器
			x=UART1Ctrl->FTPErr;//FTP错误标志:0=空,1=FTP服务器无法登录,2=找不到指定文件目录
			if((x!=0)||(FTPFileCount==(MaxFileNum+1)))
			{
				if(x==1)
				{//服务器无法登录
					y=0xFFFFFFFE;//FTP 服务器无法登录，填写0xFFFFFFFEH
				}
				else
				{
					if(x==2)
					{//服务器中找不到指定文件
						y=0xFFFFFFFD;//FTP 服务器中找不到指定文件，填写0xFFFFFFFDH
					}
					else
					{
						for(i=0;i<MaxFileNum;i++)
						{
							x=MRR(ADDR_FTPFileFlags+5+i,1);
							if(x==5)//5=文件错误
							{
								break;
							}
						}
						if(i<MaxFileNum)
						{//有文件错误
							y=0xFFFFFFFF;//检查发现文件错误，填写0xFFFFFFFFH
						}
						else
						{
							y=0;
						}
					}
				}
				MWR(FTPFileCount+1,ADDR_FTPFileFlags+4,1);//FTP文件下载且已返回帧标志
				
				p8rx=(u8 *)ADDR_DATABUFF;
				p8tx=(u8 *)Get_ADDR_UARTnTx(GPRSPORT);
				MR(ADDR_DATABUFF,ADDR_AFN0FF1_Rx,256);//恢复FTP接收帧的前256字节
				MR((u32)p8tx,ADDR_AFN0FF1_Tx,18);//恢复FTP返回帧的前18字节
				MWR(y,((u32)p8tx)+18,4);//返回标识4字节
				i=4+4;//返回长度
				i+=8;//1字节控制域+5字节地址域+1字节AFN+1字节SEQ=8字节
				p8tx[1]=i;
				p8tx[2]=i>>8;
				i=p8rx[1]+(p8rx[2]<<8);
//				Uart_376_AUX(GPRSPORT,((u32)p8rx)+6+i-6);//附加信息(EC,TP),暂等待单帧数据发送
//				Uart_376_CS((u32)p8tx);//和校验计算,同时加结束0x16;修改长度字节的标志位
				
