gdgly/NUC97X_JS/STM32F4xx/Device/GPRS_3763_back.c
				GPRS_3763_NextATCount();//下1个AT
				UART1Ctrl->ATTask=0;//AT任务:0=空闲,1=发送,2=正在发送,3=接收

			#if (USER/100)==5//上海
				i=MRR(ADDR_AFN0FF97,1);//1byte 命令发起标志:0=不是F97命令,1=是F97命令发起
				if(i!=0)
				{//是F97命令发起,无返回帧
					UART1Ctrl->Task=0;//0=接收
				}
				//升级后终端软件版本号	ASCII	10
				MC(0,ADDR_DATABUFF,10);
				p8rx=(u8*)(ADDR_DATABUFF);
				p8rx[0]='Z';
				p8rx[1]='Z';
				p8rx[2]=((SVER>>4)&0xf)+0x30;
				p8rx[3]=((SVER>>0)&0xf)+0x30;
				//发生时间：分时日月年	见附录A.15	5
				MR(ADDR_DATABUFF+10,ADDR_TYMDHMS+1,5);
				MW(ADDR_DATABUFF,ADDR_AFN0FF98+10,15);
			#endif
				return;
			}
	#if Extern_GPRS_FTP_RxTx==0//外部程序:0=I2,1=E1,2=E2,3=;W5200 GPRS文件下载
			TxByte=GPRS_FTP_Tx();//GPRS_FTP_Tx发送
	#else
			if((Comm_Ram->SoftModule&(1<<4))==0)//软件模块错误标志(置位表示错误):B0= ,B1=I1,B2=I2,B3=E5,B4=E1,B5=E2,B6=E3,B7=E4
			{
    		p32=(u32 *)(ADDR_E1_ENTRY);
    		TxByte=(*(u32(*)())p32[106])();//GPRS_FTP_Tx发送
			}
	#endif
			break;
			
		case AT_SMS_NOLINK://短信服务没连接前
		case AT_SMS_LINK://短信服务
		#if LEN_UART11Ctrl==0
			GPRS_3763_NextATCount();//下1个AT
		#else
			TxByte=GPRS_SMS_Tx();//GPRS_SMS_Tx发送;返回发送字节数
		#endif
			break;
			
		case AT_LOOP://AT循环,在线控制
			if(UART1Ctrl->LinkCtrl==0)//连接控制0=不连接,1=连接
			{
				if(UART1Ctrl->LinkTask==101)//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
				{
					UART1Ctrl->LinkTask=102;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
					UART1Ctrl->HeartberatCount=0;//心跳发出计数,收到确认帧清0
					Terminal_Ram->GPRSHeartBeat_S_Timer=0;//2 心跳秒定时器
				}
				if(UART1Ctrl->LinkTask==103)//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
				{
					UART1Ctrl->ATCount=AT_MYPOWEROFF;//关机
					return;
				}
			}
			UART1Ctrl->LinkSubTask=0;//尝试AT发送计数
			UART1Ctrl->SubTask=0;//子任务
			UART1Ctrl->ATCount=AT_CSQ_LINK;
			break;
			
		default:
			TxByte=CopyString((u8 *)p32[(4*AT_No)+1],p8tx);//拷贝字符串,字符串ps拷贝到pd,返回拷贝字符串的字节数
			break;
	}
	if(TxByte!=0)
	{
		//启动UART1口发送
		UART1Ctrl->BpsCtrl=0x3+(9<<5);//速率57.6K 
		Init_UARTn(GPRSPORT);//初始化UART口,入口通信控制字已填入
		UART1Ctrl->TxByte=TxByte;//发送字节数(半字对齐)
    UART1Ctrl->TxCount=0;
	#if LOG_1376_3==1//0=没,1=有
		switch(p32[4*AT_No])//AT代号
		{
			case AT_CSQ_LINK://读信号连接后(每秒1次)
			case AT_MYNETOPEN_LINK://连接检查(每秒1次)
			case AT_MYNETREAD://读数据
				
				break;
			default:
				LOG(13763,1,GPRSPORT,(u8 *)ADDR_ATTx,TxByte,1);//入口:TR=0接收=1发送;protocol=13761,13762,13763,6451997,6452007;ascii=0为hex码=1本身为ascii码
				break;
		}
	#endif
	#if DEBUG_GPRStoRS232==1//0=否,1=是;调试:GPRS口收发数据打印到RS232口
		switch(p32[4*AT_No])//AT代号
		{
			case AT_CSQ_LINK://读信号连接后(每秒1次)
			case AT_MYNETOPEN_LINK://连接检查(每秒1次)
			case AT_MYNETREAD://读数据
				
				break;
			default:
				LOGRS232(13763,1,GPRSPORT,(u8 *)ADDR_ATTx,TxByte,1);//入口:TR=0接收=1发送;protocol=13761,13762,13763,6451997,6452007;ascii=0为hex码=1本身为ascii码
				break;
		}
	#endif

		Start_UARTn_Tx(GPRSPORT);//启动UART口发送
		UART1Ctrl->ATTask=2;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
	}
}

/*
void GPRS_URC_Rx(void)//主动上报接收
{
	u8 *p8;
	u32 *p32;
	u32 Addr;
	u32 ClrByte;
	
	//数据到来主动上报 $MYURCREAD
	Addr=ATRxSearch((u32)((u8*)"$MYURCREAD"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
	if(Addr!=0)
	{
		ClrByte=10;//需清0字节数
	ClrURC:
		Addr-=(ADDR_UART1IntATRx+6);
		p8=(u8*)(ADDR_UART1IntATRx+6);
		while(ClrByte!=0)
		{
			if(Addr==0)
			{
				Addr=(LEN_UART1IntATRx-6);
			}
			Addr--;
			p8[Addr]=0;
			ClrByte--;
		}
		p32=(u32*)(&GPRS_3763_AT_Command_Lib);
		Terminal_Ram->AT_MS_Timer=p32[(4*UART1Ctrl->ATCount)+3]/10;//AT接收第一个字节超时定时值(秒)
		return;
	}
	//链路断开主动上报
	Addr=ATRxSearch((u32)((u8*)"$MYURCCLOSE: 0"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
	if(Addr!=0)
	{
		WarningOccur(GPRSPORT,(u8 *)"GPRS链路被主站断开");//告警发生,入口告警代码和告警字符串
		UART1Ctrl->ATCount=AT_MYPOWEROFF;//关机
		UART1Ctrl->ATTask=0;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
		ClrByte=10;//需清0字节数
		goto ClrURC;
	}
	//网络连接状态主动上报
	Addr=ATRxSearch((u32)((u8*)"$MYURCACT: 0,0"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
	if(Addr!=0)
	{
		WarningOccur(GPRSPORT,(u8 *)"GPRS网络主动断开");//告警发生,入口告警代码和告警字符串
		UART1Ctrl->ATCount=AT_MYPOWEROFF;//关机
		UART1Ctrl->ATTask=0;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
		ClrByte=10;//需清0字节数
		goto ClrURC;
	}
	//客户端连接主动上报
	
	
	//FTP连接断开主动上报
	
	
}
*/



void GPRS_3763_AT_Rx(void)//AT命令接收
{
	u32 i;
	u32 x;
	u32 y;
	u32 AT_No;
	u32 RxByte;
	u32 Addr;
	u8 *p8s;
	u8 *p8d;
	u16 *p16;
	u16 *p16fifo;
	u32 *p32;
	u32 p0;
	u32 p1;
#if LOG_1376_3||DEBUG_GPRStoRS232
	u8* p8LOG;
#endif
	
	DMA_UARTn_RX_Pointer(GPRSPORT);//计算DMA_UARTn接收指针值(p0)
	
	AT_No=UART1Ctrl->ATCount;//AT计数
	if(AT_No>AT_Max)
	{
		AT_No=0;
		UART1Ctrl->ATCount=0;//AT计数
	}
	p16fifo=(u16*)(ADDR_UART1IntATRx);
	if(p16fifo[0]!=p16fifo[2])
	{//有字节接收
		p16fifo[2]=p16fifo[0];
		Terminal_Ram->AT_MS_Timer=1000/10;//AT接收第一个字节后超时定时值
	}
//	if(Terminal_Ram->AT_MS_Timer!=0)
//	{//接收没完成
//		return;
//	}
//	UART1Ctrl->ATTask=0;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
	p32=(u32*)(&GPRS_3763_AT_Command_Lib);
	switch(p32[4*AT_No])//AT代号
	{
		case AT_AT://波特率检查
		#if LCDLn9Code!=0//屏幕底部(Ln=9)显示内容代号:0=终端抄表状态,1=GPRS连接状态
			DOTMIXPMODE->Ln9Code=2;//屏幕底部(Ln=9)显示内容代号:0=终端抄表状态,1=打开串口,2=检测通信模块,3=检测SIM卡,4=网络注册,5=获取信号,6=开始拨号,7=登录主站,8=登录主站成功
		#endif
			Addr=ATRxSearch((u32)((u8*)"OK\r\n"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr==0)
			{
				if(Terminal_Ram->AT_MS_Timer!=0)
				{//接收没完成
					return;
				}
			}
		#if LOG_1376_3==1//0=没,1=有
			LOG_ATRx(0);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
		#endif
		#if DEBUG_GPRStoRS232==1//0=否,1=是;调试:GPRS口收发数据打印到RS232口
			LOGRS232_ATRx(0);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
		#endif
			UART1Ctrl->ATTask=0;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
			Addr=ATRxSearch((u32)((u8*)"OK"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr==0)
			{//重发本AT
				UART1Ctrl->LinkSubTask++;//尝试AT发送计数
				if(UART1Ctrl->LinkSubTask>=3)//尝试AT发送计数
				{//中兴MC8332模块当自动速率时头2次的AT无响应(用于检测),第3次才响应
					UART1Ctrl->LinkSubTask=0;//尝试AT发送计数
					switch(UART1Ctrl->SubTask)//子任务
					{
						case 0://速率57600
						case 1://速率115200
						case 2://速率38400
						case 3://速率19200
						case 4://速率9600
						case 5://速率4800
						case 6://速率2400
						//case 7://速率1200
							UART1Ctrl->SubTask++;//子任务
							return;
						//case 10://下1个AT
						default:
						#if (USER/100)==0//用户标识,电科院测试不支持AT+IPR
							WarningOccur(GPRSPORT,(u8 *)p32[(4*AT_No)+2]);//告警发生,入口告警代码和告警字符串
							GPRS_3763_NextATCount();//下1个AT
						#else
							WarningOccur(GPRSPORT,(u8 *)p32[(4*AT_No)+2]);//告警发生,入口告警代码和告警字符串
							UART1Ctrl->ATCount=AT_MYPOWEROFF;//关机
						#endif
							return;
					}
				}
			}
			else
			{//接收到OK
				p16fifo[1]=Addr-(ADDR_UART1IntATRx+10);//修改已读指针
				if(UART1Ctrl->SubTask<10)//子任务
				{
					UART1Ctrl->SubTask+=10;//子任务
					UART1Ctrl->LinkSubTask=0;//尝试AT发送计数
				}
				else
				{
					GPRS_3763_NextATCount();//下1个AT
				}
			}
			return;
		case AT_MYTYPE://查询远程通信模块类型
			Addr=ATRxSearch((u32)((u8*)"OK\r\n"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr==0)
			{
				if(Terminal_Ram->AT_MS_Timer!=0)
				{//接收没完成
					return;
				}
			}
		#if LOG_1376_3==1//0=没,1=有
			LOG_ATRx(0);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
		#endif
		#if DEBUG_GPRStoRS232==1//0=否,1=是;调试:GPRS口收发数据打印到RS232口
			LOGRS232_ATRx(0);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
		#endif
			UART1Ctrl->ATTask=0;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
			Comm_Ram->RemoteWirelessModuleType=1;//GPRS模块类型位标志:b0=GSM网络支持GPRS,b1=WCDMA网络,b2=TD-SCDMA网络,b3=CDMA 2000,b4=CDMA EVDO,b5=LTE,b6=PSTN,b7=表示扩展一个字节
			Addr=ATRxSearch((u32)((u8*)"$MYTYPE:"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr!=0)
			{
				p16fifo[1]=Addr-(ADDR_UART1IntATRx+10);//修改已读指针
				x=ATRxSearch((u32)((u8*)","));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
				if(x!=0)
				{
					p8s=(u8*)x;
					i = ASCII_BCD(x,2);
//					i=((p8s[0]-0x30)<<4)+(p8s[1]-0x30);
					Comm_Ram->RemoteWirelessModuleType=i;//GPRS模块类型位标志:b0=GSM网络支持GPRS,b1=WCDMA网络,b2=TD-SCDMA网络,b3=CDMA 2000,b4=CDMA EVDO,b5=LTE,b6=PSTN,b7=表示扩展一个字节
				}
				Addr=ATRxSearch((u32)((u8*)"OK"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
				if(Addr!=0)
				{
					p16fifo[1]=Addr-(ADDR_UART1IntATRx+10);//修改已读指针
				}
				GPRS_3763_NextATCount();//下1个AT
				break;
			}
			Addr=ATRxSearch((u32)((u8*)"OK"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr!=0)
			{
				p16fifo[1]=Addr-(ADDR_UART1IntATRx+10);//修改已读指针
			}
			if(UART1Ctrl->LinkSubTask<=2)//尝试AT发送计数
			{
				UART1Ctrl->LinkSubTask++;//尝试AT发送计数
				break;
			}
			GPRS_3763_NextATCount();//下1个AT
			break;
			
