gdgly/NUC97X_JS/STM32F4xx/Device/GPRS_3763_back.c
		case AT_MYGMR://获取模块软件版本
			Addr=ATRxSearch((u32)((u8*)"OK\r\n"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr==0)
			{
				if(Terminal_Ram->AT_MS_Timer!=0)
				{//接收没完成
					return;
				}
			}
		#if LOG_1376_3==1//0=没,1=有
			LOG_ATRx(0);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
		#endif
		#if DEBUG_GPRStoRS232==1//0=否,1=是;调试:GPRS口收发数据打印到RS232口
			LOGRS232_ATRx(0);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
		#endif
			UART1Ctrl->ATTask=0;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
			Addr=ATRxSearch((u32)((u8*)"OK"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr!=0)
			{
			#if MainProtocol==376
				//厂商代号，ASCII，4字节
				MC(0,ADDR_DATABUFF,4);
				GetATRxString(ADDR_DATABUFF);//取AT返回当前p1指针开始以0x0d0x0a结束的字符串,入口字符串存放地址;返回:不含0x0d0x0a的字符串长度,同时修改p1指向下字符串开始
				MW(ADDR_DATABUFF,ADDR_AFN09F9,4);
				//模块型号，ASCII，8字节
				MC(0,ADDR_DATABUFF,8);
				GetATRxString(ADDR_DATABUFF);//取AT返回当前p1指针开始以0x0d0x0a结束的字符串,入口字符串存放地址;返回:不含0x0d0x0a的字符串长度,同时修改p1指向下字符串开始
				MW(ADDR_DATABUFF,ADDR_AFN09F9+4,8);
				//软件版本号，ASCII，4字节
				MC(0,ADDR_DATABUFF,4);
				GetATRxString(ADDR_DATABUFF);//取AT返回当前p1指针开始以0x0d0x0a结束的字符串,入口字符串存放地址;返回:不含0x0d0x0a的字符串长度,同时修改p1指向下字符串开始
				MW(ADDR_DATABUFF,ADDR_AFN09F9+4+8,4);
				//软件发布日期，日月年，3字节
				MC(0,ADDR_DATABUFF,6);
				GetATRxString(ADDR_DATABUFF);//取AT返回当前p1指针开始以0x0d0x0a结束的字符串,入口字符串存放地址;返回:不含0x0d0x0a的字符串长度,同时修改p1指向下字符串开始
				i=ASCII_BCD(ADDR_DATABUFF,6);//16进制的ASCII码转为BCD,例"12AB"->0x12AB,入口ASCII码开始地址和ASCII码字节数,返回=0xFFFFFFFF表示错误ASCII码非0-9,A-F值
				MWR(i,ADDR_AFN09F9+4+8+4,3);
				Data_Inverse(ADDR_AFN09F9+4+8+4,3);//数据倒序(高低字节调换),入口Le>=2
				//硬件版本号，ASCII，4字节
				MC(0,ADDR_DATABUFF,4);
				GetATRxString(ADDR_DATABUFF);//取AT返回当前p1指针开始以0x0d0x0a结束的字符串,入口字符串存放地址;返回:不含0x0d0x0a的字符串长度,同时修改p1指向下字符串开始
				MW(ADDR_DATABUFF,ADDR_AFN09F9+4+8+4+3,4);
				//硬件发布日期，日月年，3字节
				MC(0,ADDR_DATABUFF,6);
				GetATRxString(ADDR_DATABUFF);//取AT返回当前p1指针开始以0x0d0x0a结束的字符串,入口字符串存放地址;返回:不含0x0d0x0a的字符串长度,同时修改p1指向下字符串开始
				i=ASCII_BCD(ADDR_DATABUFF,6);//16进制的ASCII码转为BCD,例"12AB"->0x12AB,入口ASCII码开始地址和ASCII码字节数,返回=0xFFFFFFFF表示错误ASCII码非0-9,A-F值
				MWR(i,ADDR_AFN09F9+4+8+4+3+4,3);
				Data_Inverse(ADDR_AFN09F9+4+8+4+3+4,3);//数据倒序(高低字节调换),入口Le>=2		
				
				p16fifo[1]=Addr-(ADDR_UART1IntATRx+10);//修改已读指针
				GPRS_3763_NextATCount();//下1个AT
			#endif
			#if MainProtocol==698
//版本信息∷=structure
//{
//2 厂商代码       visible-string(SIZE (4))，
//8 软件版本号     visible-string(SIZE (4))，
//14 软件版本日期   visible-string(SIZE (6))，
//22 硬件版本号     visible-string(SIZE (4))，
//28 硬件版本日期   visible-string(SIZE (6))，
//36 厂家扩展信息   visible-string(SIZE (8))
//}
				//厂商代号，ASCII，4字节
				MC(0,ADDR_DATABUFF,4);
				GetATRxString(ADDR_DATABUFF);//取AT返回当前p1指针开始以0x0d0x0a结束的字符串,入口字符串存放地址;返回:不含0x0d0x0a的字符串长度,同时修改p1指向下字符串开始
				MW(ADDR_DATABUFF,ADDR_4500_5+4,4);
				//模块型号，ASCII，8字节
				MC(0,ADDR_DATABUFF,8);
				GetATRxString(ADDR_DATABUFF);//取AT返回当前p1指针开始以0x0d0x0a结束的字符串,入口字符串存放地址;返回:不含0x0d0x0a的字符串长度,同时修改p1指向下字符串开始
				MW(ADDR_DATABUFF,ADDR_4500_5+38,8);
				//软件版本号，ASCII，4字节
				MC(0,ADDR_DATABUFF,4);
				GetATRxString(ADDR_DATABUFF);//取AT返回当前p1指针开始以0x0d0x0a结束的字符串,入口字符串存放地址;返回:不含0x0d0x0a的字符串长度,同时修改p1指向下字符串开始
				MW(ADDR_DATABUFF,ADDR_4500_5+10,4);
				//软件发布日期，日月年，3字节
				MC(0,ADDR_DATABUFF,6);
				GetATRxString(ADDR_DATABUFF);//取AT返回当前p1指针开始以0x0d0x0a结束的字符串,入口字符串存放地址;返回:不含0x0d0x0a的字符串长度,同时修改p1指向下字符串开始
				MW(ADDR_DATABUFF,ADDR_4500_5+16,6);
				//硬件版本号，ASCII，4字节
				MC(0,ADDR_DATABUFF,4);
				GetATRxString(ADDR_DATABUFF);//取AT返回当前p1指针开始以0x0d0x0a结束的字符串,入口字符串存放地址;返回:不含0x0d0x0a的字符串长度,同时修改p1指向下字符串开始
				MW(ADDR_DATABUFF,ADDR_4500_5+24,4);
				//硬件发布日期，日月年，3字节
				MC(0,ADDR_DATABUFF,6);
				GetATRxString(ADDR_DATABUFF);//取AT返回当前p1指针开始以0x0d0x0a结束的字符串,入口字符串存放地址;返回:不含0x0d0x0a的字符串长度,同时修改p1指向下字符串开始
				MW(ADDR_DATABUFF,ADDR_4500_5+30,6);
				
				p16fifo[1]=Addr-(ADDR_UART1IntATRx+10);//修改已读指针
				GPRS_3763_NextATCount();//下1个AT
			#endif
				break;
			}
			goto ReTxAT;//重发本AT
		case AT_CPIN://卡检查
		#if LCDLn9Code!=0//屏幕底部(Ln=9)显示内容代号:0=终端抄表状态,1=GPRS连接状态
			DOTMIXPMODE->Ln9Code=3;//屏幕底部(Ln=9)显示内容代号:0=终端抄表状态,1=打开串口,2=检测通信模块,3=检测SIM卡,4=网络注册,5=获取信号,6=开始拨号,7=登录主站,8=登录主站成功
		#endif
			Addr=ATRxSearch((u32)((u8*)"OK\r\n"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr==0)
			{
				if(Terminal_Ram->AT_MS_Timer!=0)
				{//接收没完成
					return;
				}
			}
		#if LOG_1376_3==1//0=没,1=有
			LOG_ATRx(0);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
		#endif
		#if DEBUG_GPRStoRS232==1//0=否,1=是;调试:GPRS口收发数据打印到RS232口
			LOGRS232_ATRx(0);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
		#endif
			UART1Ctrl->ATTask=0;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
			Addr=ATRxSearch((u32)((u8*)"READY"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr!=0)
			{
				p16fifo[1]=Addr-(ADDR_UART1IntATRx+10);//修改已读指针
				Addr=ATRxSearch((u32)((u8*)"OK"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
				if(Addr!=0)
				{
					p16fifo[1]=Addr-(ADDR_UART1IntATRx+10);//修改已读指针
				}
				GPRS_3763_NextATCount();//下1个AT
				break;
			}
			goto ReTxAT;//重发本AT
		case AT_MYCCID://获取SIM卡序列号ICCID
			Addr=ATRxSearch((u32)((u8*)"OK\r\n"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr==0)
			{
				if(Terminal_Ram->AT_MS_Timer!=0)
				{//接收没完成
					return;
				}
			}
		#if LOG_1376_3==1//0=没,1=有
			LOG_ATRx(0);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
		#endif
		#if DEBUG_GPRStoRS232==1//0=否,1=是;调试:GPRS口收发数据打印到RS232口
			LOGRS232_ATRx(0);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
		#endif
			UART1Ctrl->ATTask=0;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
			Addr=ATRxSearch((u32)((u8*)"$MYCCID"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr!=0)
			{
				LineATIntRx(Addr+3,ADDR_DATABUFF,20);//取AT中断接收数据线性放在缓冲中
		#if MainProtocol==698
				p8s=(u8*)ADDR_4500_7;//公网通信模块1;7 SIM卡的ICCID
				//visible-string(SIZE(20))
				p8s[0]=DataType_visible_string;
				p8s[1]=20;
				MW(ADDR_DATABUFF,(u32)p8s+2,20);
		#endif
		#if MainProtocol==376
			#if (USER/100)!=12//非四川
				//四川要求AFN09F9的ICCID项填写SIM卡手机号码。
				MW(ADDR_DATABUFF,ADDR_AFN09F9+4+8+4+3+4+3,20);
			#endif
			#if (USER/100)==12//四川
				//四川扩展AFN0CF2040填写ICCID
//				MW(ADDR_DATABUFF,ADDR_AFN0CF16+8,20);
				MW(ADDR_DATABUFF,ADDR_AFN0CF2040+7,20);
			#endif
			#if (USER/100)==13//黑龙江
				WarningOccur(GPRSPORT,(u8 *)"获取SIM卡ICCID");//告警发生,入口告警代码和告警字符串
			#endif
		#endif
				p16fifo[1]=Addr-(ADDR_UART1IntATRx+6);//修改已读指针
				Addr=ATRxSearch((u32)((u8*)"OK"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
				if(Addr!=0)
				{
					p16fifo[1]=Addr-(ADDR_UART1IntATRx+10);//修改已读指针
				}
				GPRS_3763_NextATCount();//下1个AT
				break;
			}
			goto ReTxAT;//重发本AT
		case AT_CNUM://取本机号码
			Addr=ATRxSearch((u32)((u8*)"OK\r\n"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr==0)
			{
				if(Terminal_Ram->AT_MS_Timer!=0)
				{//接收没完成
					return;
				}
			}
		#if LOG_1376_3==1//0=没,1=有
			LOG_ATRx(0);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
		#endif
		#if DEBUG_GPRStoRS232==1//0=否,1=是;调试:GPRS口收发数据打印到RS232口
			LOGRS232_ATRx(0);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
		#endif
			UART1Ctrl->ATTask=0;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
			p8d=(u8*)(ADDR_MobilePhoneNumber);
			p8d[0]=0;
			Addr=ATRxSearch((u32)((u8*)"+CNUM:"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr!=0)
			{
				p16fifo[1]=Addr-(ADDR_UART1IntATRx+10);//修改已读指针
				Addr=ATRxSearch((u32)((u8*)","));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
				if(Addr!=0)
				{
					LineATIntRx(Addr,ADDR_DATABUFF,20);//取AT中断接收数据线性放在缓冲中
					p8s=(u8*)(ADDR_DATABUFF);
					if(p8s[0]=='"')
					{
						p8s++;
						for(i=0;i<19;i++)
						{
							x=p8s[i];
							if(x=='"')
							{
								break;
							}
							p8d[i]=x;
						}
						p8d[i]=0;
					}
				}
			#if MainProtocol==698
				p8s=(u8*)(ADDR_MobilePhoneNumber);
				p8d=(u8*)ADDR_4500_10;
				//visible-string(SIZE(16))
				p8d[0]=DataType_visible_string;
				for(i=0;i<16;i++)
				{
					if(p8s[i]==0)
					{
						break;
					}
					p8d[2+i]=p8s[i];
				}
				p8d[1]=i;
			#endif
		#if MainProtocol==376
			#if (USER/100)==12//四川
				//四川要求AFN09F9的ICCID项填写SIM卡手机号码。
				for(i=0;i<20;i++)
				{
					if(p8d[i]==0)
					{
						break;
					}
				}
				MC(0x30,ADDR_AFN09F9+4+8+4+3+4+3,(20-i));
				MW(ADDR_MobilePhoneNumber,ADDR_AFN09F9+4+8+4+3+4+3+(20-i),i);//写SIM卡手机号码
				if(i>8)
				{//四川扩展6个字节BCD码电话号码
					y=ASCII_BCD(ADDR_MobilePhoneNumber+i-8,8);//16进制的ASCII码转为BCD,例"12AB"->0x12AB,入口ASCII码开始地址和ASCII码字节数,返回=0xFFFFFFFF表示错误ASCII码非0-9,A-F值
					MWR(y,ADDR_AFN0CF2040+1,4);//写SIM卡手机号码
					y=ASCII_BCD(ADDR_MobilePhoneNumber,(i-8));//16进制的ASCII码转为BCD,例"12AB"->0x12AB,入口ASCII码开始地址和ASCII码字节数,返回=0xFFFFFFFF表示错误ASCII码非0-9,A-F值
					MWR(y,ADDR_AFN0CF2040+1+4,2);//写SIM卡手机号码
					Data_Inverse(ADDR_AFN0CF2040+1,6);//数据倒序(高低字节调换),入口Le>=2
				}
				else
				{
					y=ASCII_BCD(ADDR_MobilePhoneNumber,i);//16进制的ASCII码转为BCD,例"12AB"->0x12AB,入口ASCII码开始地址和ASCII码字节数,返回=0xFFFFFFFF表示错误ASCII码非0-9,A-F值
					MWR(y,ADDR_AFN0CF2040+1,4);//写SIM卡手机号码
					MWR(0,ADDR_AFN0CF2040+1+4,2);//写SIM卡手机号码
					Data_Inverse(ADDR_AFN0CF2040+1,6);//数据倒序(高低字节调换),入口Le>=2
				}		
			#endif
		#endif
			}
			else
			{
				if(UART1Ctrl->LinkSubTask<=2)//尝试AT发送计数
				{
					UART1Ctrl->LinkSubTask++;//尝试AT发送计数
					Addr=ATRxSearch((u32)((u8*)"OK"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
					if(Addr!=0)
					{
						p16fifo[1]=Addr-(ADDR_UART1IntATRx+10);//修改已读指针
					}
					break;
				}
			}
			Addr=ATRxSearch((u32)((u8*)"OK"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr!=0)
			{
				p16fifo[1]=Addr-(ADDR_UART1IntATRx+10);//修改已读指针
			}
			GPRS_3763_NextATCount();//下1个AT
			break;
		case AT_CIMI://查国际移动台标识请求IMSI
			Addr=ATRxSearch((u32)((u8*)"OK\r\n"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr==0)
			{
				if(Terminal_Ram->AT_MS_Timer!=0)
				{//接收没完成
					return;
				}
			}
		#if LOG_1376_3==1//0=没,1=有
			LOG_ATRx(0);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
		#endif
		#if DEBUG_GPRStoRS232==1//0=否,1=是;调试:GPRS口收发数据打印到RS232口
			LOGRS232_ATRx(0);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
		#endif
			UART1Ctrl->ATTask=0;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
			if(Addr!=0)
			{
				p1=p16fifo[1];
				p8s=(u8*)(ADDR_UART1IntATRx+10);
				while((p8s[p1]==0x0d)||(p8s[p1]==0x0a))
				{
					p1++;
					if(p1>=(LEN_UART1IntATRx-10))
					{
						p1-=(LEN_UART1IntATRx-10);
					}
				}
				Addr=ADDR_UART1IntATRx+10+p1;
				LineATIntRx(Addr,ADDR_DATABUFF,19);//取AT中断接收数据线性放在缓冲中
				p8s=(u8*)(ADDR_DATABUFF);
				p8d=(u8*)(ADDR_MobilePhoneNumber+20);
				for(i=0;i<19;i++)
				{
					if((p8s[i]==0x0d)||(p8s[i]==0x0a))
					{
						break;
					}
					p8d[i]=p8s[i];
				}
				p8d[i]=0;
			#if MainProtocol==698
				p8s=(u8*)(ADDR_DATABUFF);
				p8d=(u8*)(ADDR_4500_8);//公网通信模块1;8 IMSI
				//visible-string(SIZE(20))
				p8d[0]=DataType_visible_string;
				p8d[1]=19;
				p8d+=2;
				for(i=0;i<19;i++)
				{
					if((p8s[i]==0x0d)||(p8s[i]==0x0a))
					{
						break;
					}
					p8d[i]=p8s[i];
				}
			#endif
			}
			else
			{
				if(UART1Ctrl->LinkSubTask<=2)//尝试AT发送计数
				{
					UART1Ctrl->LinkSubTask++;//尝试AT发送计数
					break;
				}
			}
			Addr=ATRxSearch((u32)((u8*)"OK"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr!=0)
			{
				p16fifo[1]=Addr-(ADDR_UART1IntATRx+10);//修改已读指针
			}
			GPRS_3763_NextATCount();//下1个AT
			break;
/*
		case AT_CSPN://读取SIM卡服务运营商名称
		#if LCDLn9Code!=0//屏幕底部(Ln=9)显示内容代号:0=终端抄表状态,1=GPRS连接状态
			DOTMIXPMODE->Ln9Code=4;//屏幕底部(Ln=9)显示内容代号:0=终端抄表状态,1=打开串口,2=检测通信模块,3=检测SIM卡,4=网络注册,5=获取信号,6=开始拨号,7=登录主站,8=登录主站成功
		#endif
			Addr=ATRxSearch((u32)((u8*)"OK\r\n"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr==0)
			{
				if(Terminal_Ram->AT_MS_Timer!=0)
				{//接收没完成
					return;
				}
			}
		#if LOG_1376_3==1//0=没,1=有
			LOG_ATRx(0);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
		#endif
		#if DEBUG_GPRStoRS232==1//0=否,1=是;调试:GPRS口收发数据打印到RS232口
			LOGRS232_ATRx(0);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
		#endif
			UART1Ctrl->ATTask=0;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
			Addr=ATRxSearch((u32)((u8*)"+CSPN: \""));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr!=0)
			{
				p16fifo[1]=Addr-(ADDR_UART1IntATRx+10);//修改已读指针
//中国移动通信-----china mobile  CMCC
//中国联通通讯-----china unicom  CUCC
//中国电信  ------CHINA TELECOM  CTCC	
				x=GetATRxString(ADDR_DATABUFF);//取AT返回当前p1指针开始以0x0d0x0a结束的字符串,入口字符串存放地址;返回:不含0x0d0x0a的字符串长度,同时修改p1指向下字符串开始
				p8s=(u8*)(ADDR_DATABUFF);
				for(i=0;i<x;i++)
				{
					if(p8s[i]=='"')
					{
						p8s[i]=0;
						break;
					}
				}
				i=(p8s[0]<<24)|(p8s[1]<<16)|(p8s[2]<<8)|(p8s[3]<<0);
				switch(i)
				{
					case ('C'<<24)|('M'<<16)|('C'<<8)|('C'<<0):
						Comm_Ram->CSPN=1;//1=中国移动通信-----china mobile  CMCC
						break;
					case ('C'<<24)|('U'<<16)|('C'<<8)|('C'<<0):
						Comm_Ram->CSPN=2;//2=中国联通通讯-----china unicom  CUCC
						break;
					case ('C'<<24)|('T'<<16)|('C'<<8)|('C'<<0):
						Comm_Ram->CSPN=3;//3=中国电信  ------CHINA TELECOM  CTCC
						break;
					default:
						Comm_Ram->CSPN=255;//255=未知
						break;
				}
				WarningOccur(GPRSPORT,(u8 *)ADDR_DATABUFF);//告警发生,入口告警代码和告警字符串
			}
			
			Addr=ATRxSearch((u32)((u8*)"OK"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr!=0)
			{
				p16fifo[1]=Addr-(ADDR_UART1IntATRx+10);//修改已读指针
			}
			else
			{
				if(UART1Ctrl->LinkSubTask<=2)//尝试AT发送计数
				{
					UART1Ctrl->LinkSubTask++;//尝试AT发送计数
					break;
				}
			}
			GPRS_3763_NextATCount();//下1个AT
			break;
*/
#if (USER/100)!=0//不是电科院测试(1376.3标准无此命令)
		case AT_COPS://读取SIM卡服务运营商名称
		#if LCDLn9Code!=0//屏幕底部(Ln=9)显示内容代号:0=终端抄表状态,1=GPRS连接状态
			DOTMIXPMODE->Ln9Code=4;//屏幕底部(Ln=9)显示内容代号:0=终端抄表状态,1=打开串口,2=检测通信模块,3=检测SIM卡,4=网络注册,5=获取信号,6=开始拨号,7=登录主站,8=登录主站成功
		#endif
			Addr=ATRxSearch((u32)((u8*)"OK\r\n"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr==0)
			{
				if(Terminal_Ram->AT_MS_Timer!=0)
				{//接收没完成
					return;
				}
			}
		#if LOG_1376_3==1//0=没,1=有
			LOG_ATRx(0);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
		#endif
		#if DEBUG_GPRStoRS232==1//0=否,1=是;调试:GPRS口收发数据打印到RS232口
			LOGRS232_ATRx(0);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
		#endif
			UART1Ctrl->ATTask=0;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
			Addr=ATRxSearch((u32)((u8*)"+COPS:"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr!=0)
			{
				p16fifo[1]=Addr-(ADDR_UART1IntATRx+10);//修改已读指针
				Addr=ATRxSearch((u32)((u8*)"\""));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
				if(Addr!=0)
				{
//中国移动通信-----china mobile  CMCC   46000 46002 46004 46007 46008
//中国联通通讯-----china unicom  CUCC   46001 46006 46009 46010
//中国电信  ------CHINA TELECOM  CTCC	 46003 46005 46011 46012
					p16fifo[1]=Addr-(ADDR_UART1IntATRx+10);//修改已读指针
					x=GetATRxString(ADDR_DATABUFF);//取AT返回当前p1指针开始以0x0d0x0a结束的字符串,入口字符串存放地址;返回:不含0x0d0x0a的字符串长度,同时修改p1指向下字符串开始
					i=ASCII_HEX(ADDR_DATABUFF);//10进制的ASCII码转为HEX,例"1234"->0x04d2,入口ASCII码开始地址非0-9ASCII码为结束
					switch(i)
					{
						case 46000:
						case 46002:
						case 46004:
						case 46007:
						case 46008:
							Comm_Ram->CSPN=1;//1=中国移动通信-----china mobile  CMCC
							WarningOccur(GPRSPORT,(u8*)"CMCC");//告警发生,入口告警代码和告警字符串
							break;
						case 46001:
						case 46006:
						case 46009:
						case 46010:
							Comm_Ram->CSPN=2;//2=中国联通通讯-----china unicom  CUCC
							WarningOccur(GPRSPORT,(u8*)"CUCC");//告警发生,入口告警代码和告警字符串
							break;
						case 46003:
						case 46005:
						case 46011:
						case 46012:
							Comm_Ram->CSPN=3;//3=中国电信  ------CHINA TELECOM  CTCC
							WarningOccur(GPRSPORT,(u8*)"CTCC");//告警发生,入口告警代码和告警字符串
							break;
						default:
#if MainProtocol==376
              Comm_Ram->CSPN=1;//1=中国移动通信-----china mobile  CMCC
							WarningOccur(GPRSPORT,(u8*)"未知运营商");//告警发生,入口告警代码和告警字符串
#endif
#if MainProtocol==698
              Comm_Ram->CSPN=0;
#endif
							break;
					}
				}
#if MainProtocol==698
        i=Comm_Ram->CSPN;
        if(i==0)
        {
          p8d=(u8*)ADDR_DATABUFF;
          p8s=(u8*)(ADDR_4500_8);//公网通信模块1;8 IMSI
          MR(ADDR_DATABUFF,(u32)p8s+2,5);
          p8d[5]=0;
          i=ASCII_HEX(ADDR_DATABUFF);//10进制的ASCII码转为HEX,例"1234"->0x04d2,入口ASCII码开始地址非0-9ASCII码为结束
          switch(i)
          {
            case 46000:
            case 46002:
            case 46004:
            case 46007:
            case 46008:
              Comm_Ram->CSPN=1;//1=中国移动通信-----china mobile  CMCC
              WarningOccur(GPRSPORT,(u8*)"CMCC");//告警发生,入口告警代码和告警字符串
              break;
            case 46001:
            case 46006:
            case 46009:
            case 46010:
              Comm_Ram->CSPN=2;//2=中国联通通讯-----china unicom  CUCC
              WarningOccur(GPRSPORT,(u8*)"CUCC");//告警发生,入口告警代码和告警字符串
              break;
            case 46003:
            case 46005:
            case 46011:
            case 46012:
              Comm_Ram->CSPN=3;//3=中国电信  ------CHINA TELECOM  CTCC
              WarningOccur(GPRSPORT,(u8*)"CTCC");//告警发生,入口告警代码和告警字符串
              break;
            default:
              Comm_Ram->CSPN=0;
              break;
          }
          i=Comm_Ram->CSPN;
          if(i==0)
          {
            p8s=(u8*)ADDR_4500_7;//公网通信模块1;7 SIM卡的ICCID
            MR(ADDR_DATABUFF,(u32)p8s+2,6);
            p8d[6]=0;
            i=ASCII_HEX(ADDR_DATABUFF);//10进制的ASCII码转为HEX,例"1234"->0x04d2,入口ASCII码开始地址非0-9ASCII码为结束
            //四川要求376终端的ICCID项填写SIM卡手机号码，698终端未知
            switch(i)
            {
              case 898600:
              case 898602:
              case 898604:
              case 898607:
              case 898608:
                Comm_Ram->CSPN=1;//1=中国移动通信-----china mobile  CMCC
                WarningOccur(GPRSPORT,(u8*)"CMCC");//告警发生,入口告警代码和告警字符串
                break;
              case 898601:
              case 898606:
              case 898609:
              case 898610:
                Comm_Ram->CSPN=2;//2=中国联通通讯-----china unicom  CUCC
                WarningOccur(GPRSPORT,(u8*)"CUCC");//告警发生,入口告警代码和告警字符串
                break;
              case 898603:
              case 898605:
              case 898611:
              case 898612:
                Comm_Ram->CSPN=3;//3=中国电信  ------CHINA TELECOM  CTCC
                WarningOccur(GPRSPORT,(u8*)"CTCC");//告警发生,入口告警代码和告警字符串
                break;
              default:
                Comm_Ram->CSPN=1;//1=中国移动通信-----china mobile  CMCC
                WarningOccur(GPRSPORT,(u8*)"未知运营商");//告警发生,入口告警代码和告警字符串
                break;
            }
          }
        }
#endif
			}
			Addr=ATRxSearch((u32)((u8*)"OK"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr!=0)
			{
				p16fifo[1]=Addr-(ADDR_UART1IntATRx+10);//修改已读指针
			}
			else
			{
				if(UART1Ctrl->LinkSubTask<=2)//尝试AT发送计数
				{
					UART1Ctrl->LinkSubTask++;//尝试AT发送计数
					break;
				}
			}
			GPRS_3763_NextATCount();//下1个AT
			break;
#endif	
			//以下几个参数设置失败时不关模块,以使能收短信
		case AT_MYNETCON_APN://设置APN
		case AT_MYNETCON_USERPWD://设置USERPWD:用户名和密码
		case AT_MYNETSRV://设置服务参数
			Addr=ATRxSearch((u32)((u8*)"OK\r\n"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr==0)
			{
				if(Terminal_Ram->AT_MS_Timer!=0)
				{//接收没完成
					return;
				}
			}
		#if LOG_1376_3==1//0=没,1=有
			LOG_ATRx(0);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
		#endif
		#if DEBUG_GPRStoRS232==1//0=否,1=是;调试:GPRS口收发数据打印到RS232口
			LOGRS232_ATRx(0);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
		#endif
			UART1Ctrl->ATTask=0;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
			if(Addr!=0)
			{
			#if (USER/100)==13//黑龙江
				if(p32[4*AT_No]==AT_MYNETCON_APN)
				{
					WarningOccur(GPRSPORT,(u8 *)"设置APN");//告警发生,入口告警代码和告警字符串
				}
				if(p32[4*AT_No]==AT_MYNETCON_USERPWD)
				{
					WarningOccur(GPRSPORT,(u8 *)"设置用户名密码");//告警发生,入口告警代码和告警字符串
				}
			#endif
				p16fifo[1]=Addr-(ADDR_UART1IntATRx+6);//修改已读指针
			}
			else
			{
				if(UART1Ctrl->LinkSubTask<=2)//尝试AT发送计数
				{
					UART1Ctrl->LinkSubTask++;//尝试AT发送计数
					break;
				}
			}
			GPRS_3763_NextATCount();//下1个AT
			break;
			
