gdgly/NUC97X_JS/STM32F4xx/Device/GPRS_3763_back.c
		case AT_CSQ_NOLINK://读信号没连接前
		#if LCDLn9Code!=0//屏幕底部(Ln=9)显示内容代号:0=终端抄表状态,1=GPRS连接状态
			DOTMIXPMODE->Ln9Code=5;//屏幕底部(Ln=9)显示内容代号:0=终端抄表状态,1=打开串口,2=检测通信模块,3=检测SIM卡,4=网络注册,5=获取信号,6=开始拨号,7=登录主站,8=登录主站成功
		#endif
			Addr=ATRxSearch((u32)((u8*)"OK\r\n"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr==0)
			{
				if(Terminal_Ram->AT_MS_Timer!=0)
				{//接收没完成
					return;
				}
			}
		#if LOG_1376_3==1//0=没,1=有
			LOG_ATRx(0);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
		#endif
		#if DEBUG_GPRStoRS232==1//0=否,1=是;调试:GPRS口收发数据打印到RS232口
			LOGRS232_ATRx(0);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
		#endif
			UART1Ctrl->ATTask=0;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
			Addr=ATRxSearch((u32)((u8*)"+CSQ: "));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr!=0)
			{
				p16fifo[1]=Addr-(ADDR_UART1IntATRx+10);//修改已读指针
				UART1Ctrl->LinkSubTask=0;//尝试AT发送计数
				UART1Ctrl->SubTask=0;//子任务
				LineATIntRx(Addr,ADDR_DATABUFF,2);//取AT中断接收数据线性放在缓冲中
				GPRS_Signal(ADDR_DATABUFF);//GPRS信号强度0-4
				Addr=ATRxSearch((u32)((u8*)"OK"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
				if(Addr!=0)
				{
					p16fifo[1]=Addr-(ADDR_UART1IntATRx+10);//修改已读指针
				}
				if((Terminal_Ram->SignaldBm>=5)&&(Terminal_Ram->SignaldBm!=0x99))
				{//模块测到信号,若没信号则等待120秒
					GPRS_3763_NextATCount();//下1个AT
				}
				else
				{
					if(Terminal_Ram->GPRSWaitTx_S_Timer==0)//GPRS等待信号强度查询(连接前)定时
					{
						WarningOccur(GPRSPORT,(u8 *)"远程无线无信号");//告警发生,入口告警代码和告警字符串
						UART1Ctrl->ATCount=AT_MYPOWEROFF;//关机
					}
				}
			#if (USER/100)==13//黑龙江
				WarningOccur(GPRSPORT,(u8 *)"远程无线读信号");//告警发生,入口告警代码和告警字符串
			#endif
				return;
			}
			Addr=ATRxSearch((u32)((u8*)"OK"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr!=0)
			{
				p16fifo[1]=Addr-(ADDR_UART1IntATRx+10);//修改已读指针
			}
			goto ReTxAT;//重发本AT
		case AT_CREG://获取当前网络注册状态
			Addr=ATRxSearch((u32)((u8*)"OK\r\n"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr==0)
			{
				if(Terminal_Ram->AT_MS_Timer!=0)
				{//接收没完成
					return;
				}
			}
		#if LOG_1376_3==1//0=没,1=有
			LOG_ATRx(0);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
		#endif
		#if DEBUG_GPRStoRS232==1//0=否,1=是;调试:GPRS口收发数据打印到RS232口
			LOGRS232_ATRx(0);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
		#endif
			UART1Ctrl->ATTask=0;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
		#if (USER/100)==13//黑龙江
			Addr=ATRxSearch((u32)((u8*)"+CGREG:"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
		#else
			Addr=ATRxSearch((u32)((u8*)"+CREG:"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
		#endif
			if(Addr!=0)
			{
				p16fifo[1]=Addr-(ADDR_UART1IntATRx+10);//修改已读指针
				Addr=ATRxSearch((u32)((u8*)","));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
				if(Addr!=0)
				{
					i=MRR(Addr,1);
					Addr=ATRxSearch((u32)((u8*)"OK"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
					if(Addr!=0)
					{
						p16fifo[1]=Addr-(ADDR_UART1IntATRx+10);//修改已读指针
					}
					switch(i)
					{
						//case '0'://没有注册，ME现在并没有在搜寻要注册的新的运营商
						//case '4'://未知原因
						default:
							if(Terminal_Ram->GPRSWaitTx_S_Timer==0)//等待注册定时
							{
								WarningOccur(GPRSPORT,(u8 *)"远程无线注册失败");//告警发生,入口告警代码和告警字符串
								UART1Ctrl->ATCount=AT_MYPOWEROFF;//关机
							}
							return;
						case '1'://注册了本地网络
							GPRS_3763_NextATCount();//下1个AT
							break;
						case '2'://没有注册，但MS正在搜寻要注册的新的运营商
							if(Terminal_Ram->GPRSWaitTx_S_Timer==0)//等待注册定时
							{
								WarningOccur(GPRSPORT,(u8 *)"远程无线注册搜寻超时");//告警发生,入口告警代码和告警字符串
								UART1Ctrl->ATCount=AT_MYPOWEROFF;//关机
							}
							return;
						case '3'://注册被拒绝
							if(Terminal_Ram->GPRSWaitTx_S_Timer==0)//等待注册定时
							{
								WarningOccur(GPRSPORT,(u8 *)"远程无线注册被拒绝");//告警发生,入口告警代码和告警字符串
								UART1Ctrl->ATCount=AT_MYPOWEROFF;//关机
							}
							return;
						case '5'://注册了漫游网络
							WarningOccur(GPRSPORT,(u8 *)"远程无线注册漫游网络");//告警发生,入口告警代码和告警字符串
							GPRS_3763_NextATCount();//下1个AT
							break;
					}
					break;
				}
			}
			goto ReTxAT;//重发本AT
		case AT_SYSINFO_LINK:
		case AT_SYSINFO://查询注册网络类型：2G/3G/4G
//命令
//AT$MYSYSINFO
//返回值
//<CR><LF>$ MYSYSINFOsysmode>，<MNC>
//<CR><LF>OK<CR><LF>
//注：
//（a）<sysmode>:当前注册的网络制式：
//   （1）0：No service
//   （2）2：2G（包括GPRS,CDMA）
//   （3）3：3G（包括WCDMA,TD—S CDMA,CDMA EVD0）
//   （4）4：4G（包括FDD—LTE, FDD—LTE）
//（b）<MNC>:网络运营商代码：
//   （1）00：注册失败
//   （2）01：China Mobile（中国移动）
//   （3）02：China Unicom（中国联通）
//   （4）03：China Telecom（中国电信）
//示例：
//AT$MYSYSINFO
//$MYSYSINFO：4，01  //表示当前注册在中国移动的4G网络下
//OK
		
			Addr=ATRxSearch((u32)((u8*)"OK\r\n"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr==0)
			{
				if(Terminal_Ram->AT_MS_Timer!=0)
				{//接收没完成
					return;
				}
			}
			#if LOG_1376_3==1//0=没,1=有
			LOG_ATRx(0);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
			#endif
		#if DEBUG_GPRStoRS232==1//0=否,1=是;调试:GPRS口收发数据打印到RS232口
			LOGRS232_ATRx(0);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
		#endif
			UART1Ctrl->ATTask=0;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
			Comm_Ram->RemoteWirelessModuleType=1;//远程无线模块类型位标志:b0=GSM网络支持GPRS,b1=WCDMA网络,b2=TD-SCDMA网络,b3=CDMA 2000,b4=CDMA EVDO,b5=LTE,b6=PSTN,b7=表示扩展一个字节
			Addr=ATRxSearch((u32)((u8*)"$MYSYSINFO: "));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr!=0)
			{
				p16fifo[1]=Addr-(ADDR_UART1IntATRx+10);//修改已读指针
				p8d = (u8 *)Addr;
				i=p8d[0]-0x30;
				switch(i)
				{
					//case 0://无服务
					default:
						Comm_Ram->RemoteWirelessModuleSYSINFO=i; 
						break;
					case 0://无服务
						if(Terminal_Ram->GPRSWaitTx_S_Timer==0)
						{
							GPRS_3763_NextATCount();//下1个AT							
						}
						else
						{//等待返回正确注册网络类型：2G/3G/4G
							UART1Ctrl->LinkSubTask=0;//尝试AT发送计数											
							goto ReTxAT;
						}
						break;
					case 2://GSM/GPRS模式 2G
						//远程无线模块当前注册的网络:0=No service,1=,2=2G(GPRS,CDMA),3=3G(WCDMA,TD-SCDMA,CDMA EVD0),4=4G(FDD-LTE,TDD-LTE)
						Comm_Ram->RemoteWirelessModuleSYSINFO=i; 
						break;
					case 3://WCDMA模式 3G
						Comm_Ram->RemoteWirelessModuleSYSINFO=i; 
						break;
					case 4://17://LTE模式 4G
						Comm_Ram->RemoteWirelessModuleSYSINFO=i; 
						//Comm_Ram->RemoteWirelessModuleType=(1<<5);//b5=1
						break;
				}
				i=p8d[3]-0x30;
				switch(i)
				{
					case 0:
							if(Terminal_Ram->GPRSWaitTx_S_Timer==0)
							{						
								GPRS_3763_NextATCount();//下1个AT
							}
							else
							{//等待返回正确注册网络类型：2G/3G/4G
								UART1Ctrl->LinkSubTask=0;//尝试AT发送计数											
								goto ReTxAT;
							}
							break;
					case 1: //1=中国移动通信china mobile
					case 2: //2=中国联通通讯china unicom
					case 3: //3=中国电信CHINA TELECOM
					default:
							Comm_Ram->CSPN=i;
							break;
				}
				
