gdgly/NUC97X_JS/STM32F4xx/Device/GPRS_3763_back.c
#if (USER/100)==15//
		   	i=p8d[0]-0x30;
				x=Comm_Ram->RemoteWirelessModuleSYSINFO;//远程无线模块当前注册的网络:0=No service,1=,2=2G(GPRS,CDMA),3=3G(WCDMA,TD-SCDMA,CDMA EVD0),4=4G(FDD-LTE,TDD-LTE)
				Comm_Ram->RemoteWirelessModuleSYSINFO=i;//远程无线模块当前注册的网络:0=No service,1=,2=2G(GPRS,CDMA),3=3G(WCDMA,TD-SCDMA,CDMA EVD0),4=4G(FDD-LTE,TDD-LTE)
				if(x!=i)
				{//注册网络变化(2G,3G,4G)
					UART1Ctrl->LinkSubTask=0;//尝试AT发送计数
					UART1Ctrl->SubTask=0;//子任务
					UART1Ctrl->ATCount=AT_MYNETCON_APN;
					return;
				}
				i=p8d[3]-0x30;
        x=Comm_Ram->CSPN;
        Comm_Ram->CSPN=i;
        if(x!=i)
				{//注册网络变化(1=中国移动通信china mobile,2=中国联通通讯china unicom,3=中国电信CHINA TELECOM)
					UART1Ctrl->LinkSubTask=0;//尝试AT发送计数
					UART1Ctrl->SubTask=0;//子任务
					UART1Ctrl->ATCount=AT_MYNETCON_APN;
					return;
				}
#endif
#if (USER/100)==9//部分河南市场的电信物联网卡只支持4G网络，如果没有注册到4G网络则在此等待“GPRSWaitTx_S_Timer”秒
        x=UART1Ctrl->LinkTask;
        if(x<100)
        {//只有未登录主站时才判断是否注册到4G，登录在线之后不判断
          x=Comm_Ram->CSPN;
          if(x==3)//河南市场的电信物联网卡有可能只支持4G网络
          {
            i=Comm_Ram->RemoteWirelessModuleSYSINFO;
            switch(i)
            {
              case 4:
                break;
              default:
                if(Terminal_Ram->GPRSWaitTx_S_Timer==0)
                {
                  break;						
                }
                else
                {//等待返回正确注册网络类型：2G/3G/4G
                  UART1Ctrl->LinkSubTask=0;//尝试AT发送计数											
                  goto ReTxAT;
                }
            }
          }
        }
#endif

      }
			GPRS_3763_NextATCount();//下1个AT
			break;
		case AT_MYNETACT://激活网络连接
		#if LCDLn9Code!=0//屏幕底部(Ln=9)显示内容代号:0=终端抄表状态,1=GPRS连接状态
			DOTMIXPMODE->Ln9Code=6;//屏幕底部(Ln=9)显示内容代号:0=终端抄表状态,1=打开串口,2=检测通信模块,3=检测SIM卡,4=网络注册,5=获取信号,6=开始拨号,7=登录主站,8=登录主站成功
		#endif
			Addr=ATRxSearch((u32)((u8*)"OK\r\n"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr==0)
			{
				if(Terminal_Ram->AT_MS_Timer!=0)
				{//接收没完成
					return;
				}
			}
		#if LOG_1376_3==1//0=没,1=有
			LOG_ATRx(0);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
		#endif
		#if DEBUG_GPRStoRS232==1//0=否,1=是;调试:GPRS口收发数据打印到RS232口
			LOGRS232_ATRx(0);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
		#endif
			UART1Ctrl->ATTask=0;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
			Addr=ATRxSearch((u32)((u8*)"OK"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr!=0)
			{
			#if (USER/100)==13//黑龙江
				WarningOccur(GPRSPORT,(u8 *)"激活网络连接");//告警发生,入口告警代码和告警字符串
			#endif
				p16fifo[1]=Addr-(ADDR_UART1IntATRx+6);//修改已读指针
				GPRS_3763_NextATCount();//下1个AT
			}
			else
			{
				if(Terminal_Ram->GPRSWaitTx_S_Timer==0)//等待激活网络连接定时
				{
					WarningOccur(GPRSPORT,(u8 *)p32[(4*AT_No)+2]);//告警发生,入口告警代码和告警字符串
					//UART1Ctrl->ATCount=AT_MYPOWEROFF;//关机
					GPRS_3763_NextATCount();//下1个AT;不关机可能错误能收短信修复
				}
				return;
			}
			break;
		case AT_MYIPFILTER://IP访问控制配置
			Addr=ATRxSearch((u32)((u8*)"OK\r\n"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr==0)
			{
				if(Terminal_Ram->AT_MS_Timer!=0)
				{//接收没完成
					return;
				}
			}
		#if LOG_1376_3==1//0=没,1=有
			LOG_ATRx(0);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
		#endif
		#if DEBUG_GPRStoRS232==1//0=否,1=是;调试:GPRS口收发数据打印到RS232口
			LOGRS232_ATRx(0);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
		#endif
			UART1Ctrl->ATTask=0;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
			Addr=ATRxSearch((u32)((u8*)"OK"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr!=0)
			{
			#if (USER/100)==13//黑龙江
				WarningOccur(GPRSPORT,(u8 *)"IP访问控制配置");//告警发生,入口告警代码和告警字符串
			#endif
				p16fifo[1]=Addr-(ADDR_UART1IntATRx+6);//修改已读指针
				UART1Ctrl->LinkSubTask=0;//尝试AT发送计数
				UART1Ctrl->SubTask++;//子任务
				break;
			}
			goto ReTxAT;//重发本AT
		case AT_MYNETOPEN://开启服务
		#if LCDLn9Code!=0//屏幕底部(Ln=9)显示内容代号:0=终端抄表状态,1=GPRS连接状态
			DOTMIXPMODE->Ln9Code=7;//屏幕底部(Ln=9)显示内容代号:0=终端抄表状态,1=打开串口,2=检测通信模块,3=检测SIM卡,4=网络注册,5=获取信号,6=开始拨号,7=登录主站,8=登录主站成功
		#endif
			Addr=ATRxSearch((u32)((u8*)"OK\r\n"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr==0)
			{
				if(Terminal_Ram->AT_MS_Timer!=0)
				{//接收没完成
					return;
				}
			}
		#if LOG_1376_3==1//0=没,1=有
			LOG_ATRx(0);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
		#endif
		#if DEBUG_GPRStoRS232==1//0=否,1=是;调试:GPRS口收发数据打印到RS232口
			LOGRS232_ATRx(0);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
		#endif
			UART1Ctrl->ATTask=0;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
			Addr=ATRxSearch((u32)((u8*)"OK"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr!=0)
			{
				p16fifo[1]=Addr-(ADDR_UART1IntATRx+10);//修改已读指针
				WarningCancel(GPRSPORT);//告警取消,入口告警代码
				UART1Ctrl->LinkTask=100;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
				UART1Ctrl->LinkSubTask=0;//尝试AT发送计数
				UART1Ctrl->SubTask=0;//子任务
				UART1Ctrl->ATCount=AT_CSQ_LINK;//读信号连接后
		#if MainProtocol==376
				i=MRR(ADDR_AFN04F1+5,1);
				if(i==0x0)
				{
					i=1;//最小1分
				}
				i*=60;
				i+=60;//加60秒可能的主站发出定时误差
		#else
				//DL698.45
				i=(u32)Get_Element((u8*)ADDR_4500_2,12,0,LENmax_4500_2);//计算元素地址,使用ADDR_128KDATABUFF
				if(i)
				{
					i=MRR(i+1,2);;//心跳周期(秒)  long-unsigned
					i=(i>>8)+((i&0xff)<<8);
					if(i==0)
					{
						i=60;//最小1分
					}
				}
				else
				{
					i=60;//最小1分
				}
		#endif
				if((UART1Ctrl->TCPUDP&0x30)==0x20)//原工作模式(同F8设置字)B7=0TCP=1UDP,B6=,B5-B4=0混合模式=1客户机模式=2服务器模式,B3-B0=其它
				{//是服务器模式
					if((UART1Ctrl->TCPUDP&0x80)!=0)
					{//是UDP
						i=6000;//UDP初始等待主站登入定时60分
					}
					Terminal_Ram->GPRSHeartBeat_S_Timer=i;//GPRS心跳秒定时器
				}
			#if (USER/100)==13//黑龙江
				WarningOccur(GPRSPORT,(u8 *)"远程无线开启服务");//告警发生,入口告警代码和告警字符串
			#endif
			}
			else
			{
				WarningOccur(GPRSPORT,(u8 *)p32[(4*AT_No)+2]);//告警发生,入口告警代码和告警字符串
				GPRS_3763_NextATCount();//下1个AT
			}
			break;
			
		case AT_CSQ_NOLINK2://读信号没连接2	
		case AT_CSQ_LINK://读信号连接后
			Addr=ATRxSearch((u32)((u8*)"OK\r\n"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr==0)
			{
				if(Terminal_Ram->AT_MS_Timer!=0)
				{//接收没完成
					return;
				}
			}
		#if LOG_1376_3==1//0=没,1=有
			if(p32[4*AT_No]!=AT_CSQ_LINK)//AT代号
			{
				LOG_ATRx(0);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
			}
		#endif
		#if DEBUG_GPRStoRS232==1//0=否,1=是;调试:GPRS口收发数据打印到RS232口
			if(p32[4*AT_No]!=AT_CSQ_LINK)//AT代号
			{
				LOGRS232_ATRx(0);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
			}
		#endif
			
			UART1Ctrl->ATTask=0;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
			Addr=ATRxSearch((u32)((u8*)"+CSQ: "));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr!=0)
			{
				p16fifo[1]=Addr-(ADDR_UART1IntATRx+10);//修改已读指针
				LineATIntRx(Addr,ADDR_DATABUFF,2);//取AT中断接收数据线性放在缓冲中
				GPRS_Signal(ADDR_DATABUFF);//GPRS信号强度0-4
				Addr=ATRxSearch((u32)((u8*)"OK"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
				if(Addr!=0)
				{
					p16fifo[1]=Addr-(ADDR_UART1IntATRx+10);//修改已读指针
				}
				GPRS_3763_NextATCount();//下1个AT
				break;
			}
			Addr=ATRxSearch((u32)((u8*)"OK"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr!=0)
			{
				p16fifo[1]=Addr-(ADDR_UART1IntATRx+10);//修改已读指针
			}
			goto ReTxAT;//重发本AT
		case AT_MYNETOPEN_LINK://查询网络连接
			Addr=ATRxSearch((u32)((u8*)"OK\r\n"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr==0)
			{
				if(Terminal_Ram->AT_MS_Timer!=0)
				{//接收没完成
					return;
				}
			}
		#if LOG_1376_3==1//0=没,1=有
			//LOG_ATRx();//GPRS模块AT接收数据LOG;使用ADDR_DATABUFF
		#endif
		#if DEBUG_GPRStoRS232==1//0=否,1=是;调试:GPRS口收发数据打印到RS232口
			//LOGRS232_ATRx();//GPRS模块AT接收数据LOG;使用ADDR_DATABUFF
		#endif
			UART1Ctrl->ATTask=0;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
			Addr=ATRxSearch((u32)((u8*)"$MYNETOPEN: 0"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr!=0)
			{
				p16fifo[1]=Addr-(ADDR_UART1IntATRx+10);//修改已读指针
		#if MainProtocol==376
				MC(0,ADDR_AFN0CF4+1,16+6);
				//LocalIP     
				p16fifo[1]+=1;   //模块返回帧有差异,有带"号和不带"号的,兼容处理		
				Addr+=1;
				x=ATRxSearch((u32)((u8*)"\""));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
				if((x-1)==Addr)
				{
					Addr = x;
				}
				x=ATRxSearch((u32)((u8*)"\""));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址				
				y=ATRxSearch((u32)((u8*)","));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
				if((x<y)||(x==0))
				{
					x = y-1;
				}
				if(x>Addr)
				{
					x-=Addr;
					x-=1;
					if(x<16)
					{
						MR(ADDR_AFN0CF4+1,Addr,x);
						//显示本地IP
						CopyString((u8 *)"本IP ",(u8*)ADDR_DATABUFF);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
						MR(ADDR_DATABUFF+5,Addr,x);
						MC(0,ADDR_DATABUFF+5+x,1);
						WarningOccur(GPRSPORT,(u8 *)ADDR_DATABUFF);//告警发生,入口告警代码和告警字符串
						//local_port
						Addr+=x;
						Addr+=2;
						p16fifo[1]=Addr-(ADDR_UART1IntATRx+10);//修改已读指针
						x=ATRxSearch((u32)((u8*)","));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
						if(x>Addr)
						{
							x-=Addr;
							x-=1;
							if(x<6)
							{
								MR(ADDR_AFN0CF4+1+16,Addr,x);
							}
						}
						
