gdgly/NUC97X_JS/STM32F4xx/Device/GPRS_3763_back.c
						CopyString((u8 *)"0.0.0.0",(u8*)ADDR_DATABUFF);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
						i=DataComp(ADDR_AFN0CF4+1,ADDR_DATABUFF,7);//数据比较,返回0=相等;当Byte>8时返回1=不相等;当Byte<=8时1=Data1>Data2,2=Data1<Data2
						if(i==0)
						{//断开连接
							Addr=ATRxSearch((u32)((u8*)"OK"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
							if(Addr!=0)
							{
								p16fifo[1]=Addr-(ADDR_UART1IntATRx+10);//修改已读指针
							}
							WarningOccur(GPRSPORT,(u8 *)p32[(4*AT_No)+2]);//告警发生,入口告警代码和告警字符串
							UART1Ctrl->ATCount=AT_MYPOWEROFF;//关机
							return;
						}
					}
				}
		#else
				//DL698
				MC(0,ADDR_MobilePhoneNumber+40,16+6);
				//LocalIP			
				p16fifo[1]+=1;   //模块返回帧有差异,有带"号和不带"号的,兼容处理		
				Addr+=1;
				x=ATRxSearch((u32)((u8*)"\""));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
				if((x-1)==Addr)
				{
					Addr = x;
				}
				x=ATRxSearch((u32)((u8*)"\""));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址				
				y=ATRxSearch((u32)((u8*)","));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
				if((x<y)||(x==0))
				{
					x = y-1;
				}
				if(x>Addr)
				{
					x-=Addr;
					x-=1;
					if(x<16)
					{
						MR(ADDR_MobilePhoneNumber+40,Addr,x);
						//显示本地IP
						CopyString((u8 *)"本IP ",(u8*)ADDR_DATABUFF);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
						MR(ADDR_DATABUFF+5,Addr,x);
						MC(0,ADDR_DATABUFF+5+x,1);
						WarningOccur(GPRSPORT,(u8 *)ADDR_DATABUFF);//告警发生,入口告警代码和告警字符串
						//local_port
						Addr+=x;
						Addr+=2;
						p16fifo[1]=Addr-(ADDR_UART1IntATRx+10);//修改已读指针
						x=ATRxSearch((u32)((u8*)","));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
						if(x>Addr)
						{
							x-=Addr;
							x-=1;
							if(x<6)
							{
								MR(ADDR_MobilePhoneNumber+40+16,Addr,x);
							}
						}
						
						CopyString((u8 *)"0.0.0.0",(u8*)ADDR_DATABUFF);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
						i=DataComp(ADDR_MobilePhoneNumber+40,ADDR_DATABUFF,7);//数据比较,返回0=相等;当Byte>8时返回1=不相等;当Byte<=8时1=Data1>Data2,2=Data1<Data2
						if(i==0)
						{//断开连接
							Addr=ATRxSearch((u32)((u8*)"OK"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
							if(Addr!=0)
							{
								p16fifo[1]=Addr-(ADDR_UART1IntATRx+10);//修改已读指针
							}
							WarningOccur(GPRSPORT,(u8 *)p32[(4*AT_No)+2]);//告警发生,入口告警代码和告警字符串
							UART1Ctrl->ATCount=AT_MYPOWEROFF;//关机
							return;
						}
					}
				}
		#endif
				Addr=ATRxSearch((u32)((u8*)"OK"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
				if(Addr!=0)
				{
					p16fifo[1]=Addr-(ADDR_UART1IntATRx+10);//修改已读指针
				}
				GPRS_3763_NextATCount();//下1个AT
				break;
			}
			goto ReTxAT;//重发本AT
		case AT_MYNETREAD://读取数据
			p1=p16fifo[1];//原p1
			Addr=ATRxSearch((u32)((u8*)"$MYNETREAD: 0,"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr!=0)
			{
				p16fifo[1]=Addr-(ADDR_UART1IntATRx+10);//修改已读指针
				MC(0,ADDR_DATABUFF,64);
				i=GetATRxString(ADDR_DATABUFF);//取AT返回当前p1指针开始以0x0d0x0a结束的字符串,入口字符串存放地址;返回:不含0x0d0x0a的字符串长度,同时修改p1指向下字符串开始
				if(i!=0)
				{
					RxByte=ASCII_HEX(ADDR_DATABUFF);//10进制的ASCII码转为HEX,例"1234"->0x04d2,入口ASCII码开始地址非0-9ASCII码为结束
					i=GetATRxByte();//中断接收,计算当前p0对应p1还有未处理字节数
					if(i<(RxByte+4))//当字节数为0时原RxByte+6为空行0x0d0x0a加OK0x0d0x0a,现改为去掉空行OK0x0d0x0a,为二者兼空用RxByte+4
					{
						if(Terminal_Ram->AT_MS_Timer!=0)
						{//接收没完成
							p16fifo[1]=p1;//原p1
						}
						else
						{
							Addr=ATRxSearch((u32)((u8*)"OK"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
							if(Addr!=0)
							{
								p16fifo[1]=Addr-(ADDR_UART1IntATRx+10);//修改已读指针
							}
							UART1Ctrl->ATTask=0;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
							GPRS_3763_NextATCount();//下1个AT

						}
						return;
					}
					UART1Ctrl->ATTask=0;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
					if(RxByte)
					{
						i=MRR((u32)&UART1Ctrl->RxTxByte,4);
						i+=RxByte;
						MWR(i,(u32)&UART1Ctrl->RxTxByte,4);//通信流量
					}
					
					x=p16fifo[1];
					while(x>=(LEN_UART1IntATRx-10))
					{
						x-=(LEN_UART1IntATRx-10);
					}
					
				#if LOG_1376_3==1//0=没,1=有
					if(RxByte!=0)
					{
						LOG(13763,0,GPRSPORT,(u8 *)ADDR_UART1IntATRx+10,x,1);//入口:TR=0接收=1发送;protocol=13761,13762,13763,6451997,6452007;ascii=0为hex码=1本身为ascii码
					}
				#endif
				#if DEBUG_GPRStoRS232==1//0=否,1=是;调试:GPRS口收发数据打印到RS232口
					if(RxByte!=0)
					{
						LOGRS232(13763,0,GPRSPORT,(u8 *)ADDR_UART1IntATRx+10,x,1);//入口:TR=0接收=1发送;protocol=13761,13762,13763,6451997,6452007;ascii=0为hex码=1本身为ascii码
					}
				#endif
					
					p8s=(u8*)(ADDR_UART1IntATRx+10);
					p16=(u16*)(ADDR_UART1IntRx);
					y=p16[0];
					if(y>=(LEN_UART1IntRx-10))
					{
						y=0;
					}
					p8d=(u8*)(ADDR_UART1IntRx+10);
				#if LOG_1376_3||DEBUG_GPRStoRS232
					p8LOG=(u8*)ADDR_DATABUFF;
				#endif
					for(i=0;i<RxByte;i++)
					{
						p8d[y]=p8s[x];
				#if (LOG_1376_3||DEBUG_GPRStoRS232)
						if(RxByte<=LEN_DATABUFF)
						{
							p8LOG[0]=p8s[x];
							p8LOG++;
						}
				#endif
						x++;
						if(x>=(LEN_UART1IntATRx-10))
						{
							x=0;
						}
						y++;
						if(y>=(LEN_UART1IntRx-10))
						{
							y=0;
						}
					}
					p16fifo[1]=x;//修改已读指针
					p16[0]=y;//接收指针
				#if LOG_1376_3==1//0=没,1=有
					if(RxByte!=0)
					{
						//hex数据
						LOG_LINK(13763,0,GPRSPORT,(u8 *)ADDR_DATABUFF,RxByte,0);//入口:TR=0接收=1发送;protocol=13761,13762,13763,6451997,6452007;ascii=0为hex码=1本身为ascii码
						p16fifo[2]=x;//修改已读指针
						//acii
						LOG_ATRx(1);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
					}
				#endif
				#if DEBUG_GPRStoRS232==1//0=否,1=是;调试:GPRS口收发数据打印到RS232口
					if(RxByte!=0)
					{
						//hex数据
						LOGRS232_LINK(13763,0,GPRSPORT,(u8 *)ADDR_DATABUFF,RxByte,0);//入口:TR=0接收=1发送;protocol=13761,13762,13763,6451997,6452007;ascii=0为hex码=1本身为ascii码
						p16fifo[2]=x;//修改已读指针
						//acii
						LOGRS232_ATRx(1);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
					}
				#endif
					
					Addr=ATRxSearch((u32)((u8*)"OK"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
					if(Addr!=0)
					{
						p16fifo[1]=Addr-(ADDR_UART1IntATRx+10);//修改已读指针
					}
			#if MainProtocol==698	
				Uart_698_RxTx(GPRSPORT);//UART_3761接收发送
			#else
				Uart_3761_RxTx(GPRSPORT);//UART_3761接收发送
			#endif
					if(RxByte==0)
					{
						GPRS_3763_NextATCount();//下1个AT
					}
					return;
				}
			}
			if(Terminal_Ram->AT_MS_Timer!=0)
			{//接收没完成
				p16fifo[1]=p1;//原p1
				return;
			}
			
		#if LOG_1376_3==1//0=没,1=有
			LOG_ATRx(0);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
		#endif
		#if DEBUG_GPRStoRS232==1//0=否,1=是;调试:GPRS口收发数据打印到RS232口
			LOGRS232_ATRx(0);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
		#endif
//			if((UART1Ctrl->TCPUDP&0x30)!=0x20)//原工作模式(同F8设置字)B7=0TCP=1UDP,B6=,B5-B4=0混合模式=1客户机模式=2服务器模式,B3-B0=其它
//			{//不是服务器模式
//				goto ReTxAT;//重发本AT
//			}
			Addr=ATRxSearch((u32)((u8*)"OK"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr!=0)
			{
				p16fifo[1]=Addr-(ADDR_UART1IntATRx+10);//修改已读指针
			}
			UART1Ctrl->ATTask=0;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
			GPRS_3763_NextATCount();//下1个AT
			break;
		case AT_MYNETWRITE://发送数据
			switch(UART1Ctrl->ATWriteTask)//AT数据发送任务:0=发命令,1=发数据
			{
				case 0://发AT头
					Addr=ATRxSearch((u32)((u8*)"$MYNETWRITE: 0,"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
					if(Addr==0)
					{
						if(Terminal_Ram->AT_MS_Timer!=0)
						{//接收没完成
							return;
						}
					}
					UART1Ctrl->ATTask=1;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
					y=p16fifo[1];//y=原p1
					
