gdgly/NUC97X_JS/STM32F4xx/Device/GPRS_3763_back.c
					if(Addr!=0)
					{
						p16fifo[1]=Addr-(ADDR_UART1IntATRx+10);//修改已读指针
						MC(0,ADDR_DATABUFF,64);
								
						p0=p16fifo[0];//p0
						p1=p16fifo[1];//p1
						p8s=(u8*)(ADDR_UART1IntATRx+10);
						p8d=(u8*)(ADDR_DATABUFF);
						if(p0>=p1)
						{
							RxByte=p0-p1;
						}
						else
						{
							RxByte=(p0+(LEN_UART1IntATRx-10))-p1;
						}
						//取字符串
						i=0;
						while(RxByte!=0)
						{
							p8d[i]=p8s[p1];
							i++;
							if(i>=8)
							{//字符串太长错
								i=0;
							}
							p1++;
							if(p1>=(LEN_UART1IntATRx-10))
							{
								p1=0;
							}
							RxByte--;
						}
						p16fifo[1]=p1;
						
						//i=GetATRxString(ADDR_DATABUFF);//取AT返回当前p1指针开始以0x0d0x0a结束的字符串,入口字符串存放地址;返回:不含0x0d0x0a的字符串长度,同时修改p1指向下字符串开始
						if(i==0)
						{//不含0x0d0x0a的字符串长度
							if(Terminal_Ram->AT_MS_Timer!=0)
							{//接收没完成
								UART1Ctrl->ATTask=3;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
								p16fifo[1]=y;//y=原p1
								return;
							}
						}
						else
						{
							i=ASCII_HEX(ADDR_DATABUFF);//10进制的ASCII码转为HEX,例"1234"->0x04d2,入口ASCII码开始地址非0-9ASCII码为结束
							if(i!=0x0)
							{
								x=Terminal_Ram->CopyTxByte;//还需发送字节数
								if(x>1460)
								{
									x=1460;
								}
								if((i>=x)||(Terminal_Ram->AT_MS_Timer==0))//i>=还需发送字节数或接收超时
								{
						#if LOG_1376_3==1//0=没,1=有
							p16fifo[1]=y;//y=原p1
							LOG_ATRx(0);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
							p16fifo[1]=p1;
						#endif
						#if DEBUG_GPRStoRS232==1//0=否,1=是;调试:GPRS口收发数据打印到RS232口
							p16fifo[1]=y;//y=原p1
							LOGRS232_ATRx(0);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
							p16fifo[1]=p1;
						#endif
									Terminal_Ram->ReqTxByte=i;//请求发送字节数
									UART1Ctrl->LinkSubTask=0;//尝试AT发送计数
									UART1Ctrl->ATWriteTask=1;//AT数据发送任务:0=发命令,1=发数据
									Terminal_Ram->GPRSWaitTx_S_Timer=1*60;//1分,GPRS发送数据等待超时秒定时器
									return;
								}
								else
								{
									UART1Ctrl->ATTask=3;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
									p16fifo[1]=y;//y=原p1
									return;
								}
							}
						}
					}
					if(Terminal_Ram->GPRSWaitTx_S_Timer!=0)//2分,GPRS发送数据等待超时秒定时器
					{
						return;
					}
					else
					{
						if(UART1Ctrl->LinkTask==101)//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
						{
							WarningOccur(GPRSPORT,(u8 *)"远程无线等待发送超时");//告警发生,入口告警代码和告警字符串
						}
						else
						{
							WarningOccur(GPRSPORT,(u8 *)"远程无线登录主站失败");//告警发生,入口告警代码和告警字符串
						}
						UART1Ctrl->ATCount=AT_MYPOWEROFF;//关机
					}
					break;
				case 1://发数据
					Addr=ATRxSearch((u32)((u8*)"OK\r\n"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
					if(Addr==0)
					{
						if(Terminal_Ram->AT_MS_Timer!=0)
						{//接收没完成
							return;
						}
					}
		#if LOG_1376_3==1//0=没,1=有
			LOG_ATRx(1);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
		#endif
		#if DEBUG_GPRStoRS232==1//0=否,1=是;调试:GPRS口收发数据打印到RS232口
			LOGRS232_ATRx(1);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
		#endif
					UART1Ctrl->ATTask=0;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
					Addr=ATRxSearch((u32)((u8*)"OK"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
					if(Addr!=0)
					{
						p16fifo[1]=Addr-(ADDR_UART1IntATRx+10);//修改已读指针
					}
					UART1Ctrl->ATWriteTask=0;//AT数据发送任务:0=发命令,1=发数据
					if(Terminal_Ram->CopyTxByte!=0x0)//还需发送字节数
					{
						UART1Ctrl->ATTask=1;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
						UART1Ctrl->LinkSubTask=0;//尝试AT发送计数
					}
					else
					{
						if(UART1Ctrl->Task==6)
						{//多帧数据正在发送
						#if MainProtocol==376
							UART1Ctrl->Task=4;//4=多帧数据续接收完成
						#else
							UART1Ctrl->Task=0;//0=接收
						#endif
						}
						else
						{
							UART1Ctrl->Task=0;//0=接收
						}
						GPRS_3763_NextATCount();//下1个AT
					}
					break;
			}
			break;
		case AT_MYFTP://FTP文件下载
	#if Extern_GPRS_FTP_RxTx==0//外部程序:0=I2,1=E1,2=E2,3=;W5200 GPRS文件下载
			GPRS_FTP_Rx();//GPRS_FTP_Rx接收
	#else
			if((Comm_Ram->SoftModule&(1<<4))==0)//软件模块错误标志(置位表示错误):B0= ,B1=I1,B2=I2,B3=E5,B4=E1,B5=E2,B6=E3,B7=E4
			{
    		p32=(u32 *)(ADDR_E1_ENTRY);
    		(*(void(*)())p32[107])();//GPRS_FTP_Rx接收
			}
	#endif	
			break;
		case AT_SMS_NOLINK://短信服务没连接前
		case AT_SMS_LINK://短信服务
		#if LEN_UART11Ctrl!=0
			GPRS_SMS_Rx();//GPRS_SMS_Rx接收
		#endif
			break;
			
			
		case AT_HOLD://HOLD暂停
			UART1Ctrl->ATTask=0;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
			break;
		case AT_MYPOWEROFF://关机
			Addr=ATRxSearch((u32)((u8*)"OK\r\n"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr==0)
			{
				if(Terminal_Ram->AT_MS_Timer!=0)
				{//接收没完成
					return;
				}
			}
		#if LOG_1376_3==1//0=没,1=有
			LOG_ATRx(0);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
		#endif
		#if DEBUG_GPRStoRS232==1//0=否,1=是;调试:GPRS口收发数据打印到RS232口
			LOGRS232_ATRx(0);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
		#endif
			UART1Ctrl->ATTask=0;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
			Addr=ATRxSearch((u32)((u8*)"OK"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr!=0)
			{
				p16fifo[1]=Addr-(ADDR_UART1IntATRx+10);//修改已读指针
				UART1Ctrl->LinkTask=0;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
				Comm_Ram->UART1Timer=15000/10;//关机延时15s
#if (USER/100)==13//黑龙江
				WarningOccur(GPRSPORT,(u8 *)"模块正在关机");//告警发生,入口告警代码和告警字符串
#endif
			}
			else
			{
				UART1Ctrl->LinkSubTask++;//尝试AT发送计数
				if(UART1Ctrl->LinkSubTask<=2)//尝试AT发送计数
				{
					UART1Ctrl->ATTask=1;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
					UART1Ctrl->ATCount=AT_MYPOWEROFF;//关机
				}
				else
				{
					UART1Ctrl->LinkTask=0;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
					Comm_Ram->UART1Timer=15000/10;//关机延时15s
				}
			}
			break;
		default:
			Addr=ATRxSearch((u32)((u8*)"OK\r\n"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr==0)
			{
				if(Terminal_Ram->AT_MS_Timer!=0)
				{//接收没完成
					return;
				}
			}
		#if LOG_1376_3==1//0=没,1=有
			LOG_ATRx(0);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
		#endif
		#if DEBUG_GPRStoRS232==1//0=否,1=是;调试:GPRS口收发数据打印到RS232口
			LOGRS232_ATRx(0);//GPRS模块AT接收数据LOG;入口:link=0新log,=1接上log;使用ADDR_DATABUFF
		#endif
			UART1Ctrl->ATTask=0;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
			Addr=ATRxSearch((u32)((u8*)"OK"));//AT命令返回数据搜索;入口:ADDR_String为要找的以0结束的字符串或数据串地址,返回:0=没找到,!=0为找到相同串后的第1个字节地址
			if(Addr!=0)
			{
				p16fifo[1]=Addr-(ADDR_UART1IntATRx+10);//修改已读指针
				GPRS_3763_NextATCount();//下1个AT
			}
			else
			{
			ReTxAT://重发本AT
				UART1Ctrl->LinkSubTask++;//尝试AT发送计数
				if(UART1Ctrl->LinkSubTask>=(NUM_ReATTx+1))//尝试AT发送计数
				{
					WarningOccur(GPRSPORT,(u8 *)p32[(4*AT_No)+2]);//告警发生,入口告警代码和告警字符串
					UART1Ctrl->ATCount=AT_MYPOWEROFF;//关机
				}
				return;
			}
			break;
	}
}


void GPRS_3763_AT_RxTx(void)//GPRS_3763模块AT接收发送
{
	u32 *p32;
	switch(UART1Ctrl->ATTask)//AT任务:0=空闲,1=发送,2=正在发送,3=接收
	{
		case 1://发送
			GPRS_3763_AT_Tx();//AT命令发送
			break;
		case 2://正在发送
			if(Wait_UARTn_Tx(GPRSPORT)==0)//等待UART口发送,返回0=发送完成,1=发送没完成
			{
				p32=(u32*)(&GPRS_3763_AT_Command_Lib);
				switch(p32[4*UART1Ctrl->ATCount])//AT代号
				{
					case AT_SMS_NOLINK://短信服务没连接前
					case AT_SMS_LINK://短信服务连接
						if(UART1Ctrl->SubTask==1)//子任务
						{//发SMS的数据
							Terminal_Ram->AT_MS_Timer=30000/10;//GPRS AT命令用10MS定时器
						}
						else
						{
							Terminal_Ram->AT_MS_Timer=p32[(4*UART1Ctrl->ATCount)+3]/10;//GPRS AT命令用10MS定时器
						}
						break;
					default:
						Terminal_Ram->AT_MS_Timer=p32[(4*UART1Ctrl->ATCount)+3]/10;//GPRS AT命令用10MS定时器
						break;
				}
				UART1Ctrl->ATTask=3;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
				break;
			}
			break;
		case 3://接收
			GPRS_3763_AT_Rx();//AT命令接收
			break;
		default:
			UART1Ctrl->ATTask=0;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
			break;
	}
}


void UnInit_GPRS_3763(void)//GPRS模块引脚为输入下拉
{
#ifdef IC_STM32F4xx
	u32 i;
	i=
					0|//B3-B0:复用功能选择AF(0-15)
		 (0<<4)|//B5-B4:模式:00：输入（复位状态）,01：通用输出模式,10：复用功能模式,11：模拟模式
		 (0<<6)|//B6   :输出类型:0：输出推挽（复位状态）,1：输出开漏
		 (0<<7)|//B8-B7:输出速度:00：2 MHz（低速）,01：25 MHz（中速）,10：50 MHz（快速）,11：30 pF 时为 100 MHz（高速）（15 pF 时为 80 MHz 输出（最大速度））
		 (1<<9)|//B10-B9:上拉/下拉:00：无上拉或下拉,01：上拉,10：下拉,11：保留
		(0<<11);//B11  :当为输出时：0=输出0,1=输出1	
	Pin_Configure(PIN_ON_GPRS,i);//on/off
	Pin_Configure(PIN_RST_GPRS,i);//reset
	i=
					0|//B3-B0:复用功能选择AF(0-15)
		 (0<<4)|//B5-B4:模式:00：输入（复位状态）,01：通用输出模式,10：复用功能模式,11：模拟模式
		 (0<<6)|//B6   :输出类型:0：输出推挽（复位状态）,1：输出开漏
		 (0<<7)|//B8-B7:输出速度:00：2 MHz（低速）,01：25 MHz（中速）,10：50 MHz（快速）,11：30 pF 时为 100 MHz（高速）（15 pF 时为 80 MHz 输出（最大速度））
		 (2<<9)|//B10-B9:上拉/下拉:00：无上拉或下拉,01：上拉,10：下拉,11：保留
		(0<<11);//B11  :当为输出时：0=输出0,1=输出1	
	Pin_Configure(PIN_USART6_TX,i);//TXD
	Pin_Configure(PIN_USART6_RX,i);//RXD
	//RI
#endif
#ifdef IC_NUC9xx
	u32 i;
	i=
					0|//B3-B0:复用功能选择AF(0-15)
		 (0<<4)|//B5-B4:模式:00：输入（复位状态）,01：通用输出模式,10：复用功能模式,11：模拟模式
		 (0<<6)|//B6   :输出类型:0：输出推挽（复位状态）,1：输出开漏
		 (0<<7)|//B8-B7:输出速度:00：2 MHz（低速）,01：25 MHz（中速）,10：50 MHz（快速）,11：30 pF 时为 100 MHz（高速）（15 pF 时为 80 MHz 输出（最大速度））
		 (1<<9)|//B10-B9:上拉/下拉:00：无上拉或下拉,01：上拉,10：下拉,11：保留
		(0<<11);//B11  :当为输出时：0=输出0,1=输出1	
	Pin_Configure(PIN_ON_GPRS,i);//on/off
	Pin_Configure(PIN_RST_GPRS,i);//reset
	i=
					0|//B3-B0:复用功能选择AF(0-15)
		 (0<<4)|//B5-B4:模式:00：输入（复位状态）,01：通用输出模式,10：复用功能模式,11：模拟模式
		 (0<<6)|//B6   :输出类型:0：输出推挽（复位状态）,1：输出开漏
		 (0<<7)|//B8-B7:输出速度:00：2 MHz（低速）,01：25 MHz（中速）,10：50 MHz（快速）,11：30 pF 时为 100 MHz（高速）（15 pF 时为 80 MHz 输出（最大速度））
		 (2<<9)|//B10-B9:上拉/下拉:00：无上拉或下拉,01：上拉,10：下拉,11：保留
		(0<<11);//B11  :当为输出时：0=输出0,1=输出1	
	Pin_Configure(PIN_UART_TXD6,i);//TXD
	Pin_Configure(PIN_UART_RXD6,i);//RXD
	//RI
#endif
}

void GPRS_3763_RxTx(void)//远程无线GPRS模块接收发送
{
	u32 i;
	u32 x;
#if MainProtocol==698
	u32 LEN_UARTnTx;
	u32 LEN_ADDR;
	u32 LEN_TAPDU;
	u32 LEN_TxAPDU;
	u32 LEN_Tx;
	u8* p8tx;
#endif
	
