gdgly/NUC97X_JS/STM32F4xx/Device/GPRS_3763_back.c
/*
//自测命令
	if(Comm_Ram->SelfTestCommand==0x55555555)
	{
		if(UART1Ctrl->LinkCount>2)
		{//备ip
			UART1Ctrl->LinkCount=0;//以太网登主IP
			if(UART1Ctrl->LinkTask>=8)
			{//8=初始化AT命令
				UART1Ctrl->LinkTask=1;//关总电源
			}
		}
	}
*/
//初始化
	if(Comm_Ram->POWER<3)//电源:0=电池供电,1=电网供电转电池供电重启动,2=电网供电转电池供电,3=电网供电
	{
		if(UART1Ctrl->LinkTask>2)//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
		{//开电源后
			if(Pin_Read(PIN_ENR5V0)==0)//读引脚,入口引脚使用名;返回0或1
			{//中断中关了电源
				//UART1Ctrl->PORT=0;//本机端口号,同时用于掉电时已连接过1次识别
				UART1Ctrl->LinkTask=1;//1=关电源
				return;
			}
		}
	}
	switch(UART1Ctrl->LinkTask)//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
	{
		case 0://0=关机延时
			Terminal_Ram->Signal=0;//GPRS信号强度0-4
			Terminal_Ram->SignaldBm=0x99;//信号强度0-31或99
			if(Comm_Ram->UART1Timer==0x0)
			{
				UART1Ctrl->LinkTask++;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
			}
			return;//共用UART1Timer直接返回
		case 1://1=关总电源
			UnInit_GPRS_3763();//GPRS模块引脚为输入下拉
		
//			i=MRR(ADDR_TERMINAL,1);//终端地址的低1字节作为随机数
//			i&=0x0f;
//			i*=100;//0-30秒的随机延时
//			if((Comm_Ram->Factory==0x55)||(Comm_Ram->POWER<3))
//			{//工厂模式或电池供电时登录不加随机延时方便工厂生产测试和立即登录
//				i=0;
//			}
			i=0;
		
			x=Comm_Ram->MYMDHMS[1]+(Comm_Ram->MYMDHMS[2]<<8);//时分
			if(x<0x0030)
			{//是小于0时30分,关电源
				OffR5V0();//关R5V0电源
				//关闭总电源延时20秒+(0-30秒的随机延时)
				i+=20000/10;
			}
			else
			{//大于0时30分,不关电源
			#if ((USER/100)==7)//用户标识:浙江集中器加超级电容版  				
			  if(Pin_Read(PIN_PWR_DOWN)==0)//读引脚,入口引脚使用名;返回0或1	
				{
					OffR5V0();//关R5V0电源
					i=10000/10;//10s
        }	
			#endif	
			}
			Comm_Ram->UART1Timer=i;
			UART1Ctrl->LinkTask++;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
			return;//共用UART1Timer直接返回
		case 2://开总电源
			if(Comm_Ram->POWER<3)//电源:0=电池供电,1=电网供电转电池供电重启动,2=电网供电转电池供电,3=电网供电
			{
				//本机端口号,同时用于掉电时已连接过1次识别
				if(UART1Ctrl->PORT==0)
				{
					UART1Ctrl->PORT=1;
				}
				else
				{
					return;//电池供电时连接1次后停止
				}
			}
			GPRS_Voltage();//GPRS电源电压ADC测量
			if(Comm_Ram->UGPRS<0x0030)//BCD 2位小数
			{//<0.30V
				
//				i=MRR(ADDR_TERMINAL,1);//终端地址的低1字节作为随机数
//				i&=0x0f;
//				i*=100;
				i=0;
				
				i+=10000/10;
				if(Comm_Ram->UART1Timer<=i)
				{//至小已延时10秒+(0-30秒的随机延时)
					Comm_Ram->UART1Timer=0x0;
				}
			}
			if(Comm_Ram->UART1Timer==0x0)
			{
				OnR5V0();//打开R5V0电源
				Comm_Ram->UART1Timer=1000/10;//开总电源延时1秒
				UART1Ctrl->LinkTask++;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
			}
			return;//共用UART1Timer直接返回
		case 3://开模块ON/OFF输出=0
			if(Comm_Ram->UART1Timer==0x0)
			{
  			if(Comm_Ram->POWER==3)//电源:0=电池供电,1=电网供电转电池供电重启动,2=电网供电转电池供电,3=电网供电
  			{
					Comm_Ram->UART1Timer=1000/10;//延时
					while(1)
					{
						GPRS_Voltage();//GPRS电源电压ADC测量
						x=Comm_Ram->UGPRS;
						if((x<0x0350)||(x>0x0450))//BCD 2位小数
						{//3.80V>电压>4.20V(送电科院时免误判,用3.50V和4.50V)
							if(Comm_Ram->UART1Timer==0)
							{
								Comm_Ram->ErrorIC|=1<<30;//B30=GPRS模块电源
								Comm_Ram->DisplayAllErrorTimer=10;//上电全显或系统错误显示秒定时器
								break;
							}
						}
						else
						{
							break;
						}
					}
				}
				MC(0,ADDR_UART1IntATRx,LEN_UART1IntATRx);
				UART1Ctrl->Task=0;//0=正在接收
				UART1Ctrl->Lock=0;//0x55=通信功能正在被调用禁止其他程序再次调用
				UART1Ctrl->RxByte=0;//接收字节数=0
				UART1Ctrl->HostACK=0;//主动上报需主站确认帧标记:0=无,1=登录帧,2=退出登录帧,3=心跳帧,4=重要事件,5=定时任务
				UART1Ctrl->HeartberatCount=0;//心跳发出计数,收到确认帧清0
				Terminal_Ram->GPRSHeartBeat_S_Timer=0;//心跳发出秒定时器
				UART1Ctrl->ATTask=0;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
				UART1Ctrl->ATCount=0;//AT计数
				UART1Ctrl->LinkSubTask=0;//尝试AT发送计数
				UART1Ctrl->SubTask=0;//子任务
				UART1Ctrl->LinkTask2=0;//通道2链接任务(FTP命令)
				UART1Ctrl->NETOPENCount=0;//开启服务连续次数计数(当前次数达到x次时关模块电源)
				UART1Ctrl->FTPErr=0;//FTP错误标志:0=空,1=FTP服务器无法登录,2=找不到指定文件目录
			#if MainProtocol==698
				UART1Ctrl->ReNewLink=0;//0x55=通信参数变化当前帧发送完成后重新连接
			#endif
				Terminal_Ram->GPRS_ONOFF_MS_Timer=1010/10;//15 GPRS ONOFF脚控制,=1输出高,0=不变
				Pin_Configure(PIN_ON_GPRS,//ON输出=0
								0|//B3-B0:复用功能选择AF(0-15)
					 (1<<4)|//B5-B4:模式:00：输入（复位状态）,01：通用输出模式,10：复用功能模式,11：模拟模式
					 (0<<6)|//B6   :输出类型:0：输出推挽（复位状态）,1：输出开漏
					 (0<<7)|//B8-B7:输出速度:00：2 MHz（低速）,01：25 MHz（中速）,10：50 MHz（快速）,11：30 pF 时为 100 MHz（高速）（15 pF 时为 80 MHz 输出（最大速度））
					 (0<<9)|//B10-B9:上拉/下拉:00：无上拉或下拉,01：上拉,10：下拉,11：保留
					(0<<11));//B11  :当为输出时：0=输出0,1=输出1
				Pin_Configure(PIN_RST_GPRS,//RESET输入,上拉
								0|//B3-B0:复用功能选择AF(0-15)
					 (0<<4)|//B5-B4:模式:00：输入（复位状态）,01：通用输出模式,10：复用功能模式,11：模拟模式
					 (0<<6)|//B6   :输出类型:0：输出推挽（复位状态）,1：输出开漏
					 (0<<7)|//B8-B7:输出速度:00：2 MHz（低速）,01：25 MHz（中速）,10：50 MHz（快速）,11：30 pF 时为 100 MHz（高速）（15 pF 时为 80 MHz 输出（最大速度））
					 (1<<9)|//B10-B9:上拉/下拉:00：无上拉或下拉,01：上拉,10：下拉,11：保留
					(0<<11));//B11  :当为输出时：0=输出0,1=输出1	
				Comm_Ram->UART1Timer=2000/10;//2S延时等待中断中完成
				UART1Ctrl->LinkTask++;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
			}
			return;//共用UART1Timer直接返回
		case 4://PIN_ON_RST输出1S±10%延时
			if(Comm_Ram->UART1Timer==0x0)
			{
				Pin_OutH(PIN_ON_GPRS);//ON输出=1
				Comm_Ram->UART1Timer=3000/10;//延时后复位
				UART1Ctrl->LinkTask++;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
			}
			return;//共用UART1Timer直接返回
		case 5://复位
			if(Comm_Ram->UART1Timer==0x0)
			{
				Pin_Configure(PIN_RST_GPRS,//RESET
								0|//B3-B0:复用功能选择AF(0-15)
					 (1<<4)|//B5-B4:模式:00：输入（复位状态）,01：通用输出模式,10：复用功能模式,11：模拟模式
					 (0<<6)|//B6   :输出类型:0：输出推挽（复位状态）,1：输出开漏
					 (0<<7)|//B8-B7:输出速度:00：2 MHz（低速）,01：25 MHz（中速）,10：50 MHz（快速）,11：30 pF 时为 100 MHz（高速）（15 pF 时为 80 MHz 输出（最大速度））
					 (0<<9)|//B10-B9:上拉/下拉:00：无上拉或下拉,01：上拉,10：下拉,11：保留
					(0<<11));//B11  :当为输出时：0=输出0,1=输出1	
				
				Comm_Ram->UART1Timer=300/10;//复位延时0.3秒(>=200ms)
				UART1Ctrl->LinkTask++;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
			}
			return;//共用UART1Timer直接返回
		case 6://复位解除
			if(Comm_Ram->UART1Timer==0x0)
			{
				Pin_Configure(PIN_RST_GPRS,//RESET输入,上拉
								0|//B3-B0:复用功能选择AF(0-15)
					 (0<<4)|//B5-B4:模式:00：输入（复位状态）,01：通用输出模式,10：复用功能模式,11：模拟模式
					 (0<<6)|//B6   :输出类型:0：输出推挽（复位状态）,1：输出开漏
					 (0<<7)|//B8-B7:输出速度:00：2 MHz（低速）,01：25 MHz（中速）,10：50 MHz（快速）,11：30 pF 时为 100 MHz（高速）（15 pF 时为 80 MHz 输出（最大速度））
					 (1<<9)|//B10-B9:上拉/下拉:00：无上拉或下拉,01：上拉,10：下拉,11：保留
					(0<<11));//B11  :当为输出时：0=输出0,1=输出1	
				Comm_Ram->UART1Timer=10000/10;//发AT命令前延时;GPRS上电后10秒内完成初始化并能接受AT命令
				UART1Ctrl->LinkTask++;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
			}
			return;//共用UART1Timer直接返回
		case 7://初始化UART1
		#if LCDLn9Code!=0//屏幕底部(Ln=9)显示内容代号:0=终端抄表状态,1=GPRS连接状态
			DOTMIXPMODE->Ln9Code=1;//屏幕底部(Ln=9)显示内容代号:0=终端抄表状态,1=打开串口,2=检测通信模块,3=检测SIM卡,4=网络注册,5=获取信号,6=开始拨号,7=登录主站,8=登录主站成功
		#endif
			if(Comm_Ram->UART1Timer==0x0)
			{
				UART1Ctrl->BpsCtrl=0x3+(9<<5);//初始速率57.6
				Init_UARTn(GPRSPORT);//初始化UART口,入口通信控制字已填入
				UART1Ctrl->LinkTask++;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
			}
			return;//共用UART1Timer直接返回
		case 8://初始化AT命令
			break;
		case 100://连接ok
		case 101://登录ok
		case 102://发退出登录
			break;
		case 103://退出登录
		case 104://关机
			if(UART1Ctrl->ATTask==0)//AT任务:0=空闲,1=发送,2=正在发送,3=接收
			{
				UART1Ctrl->ATCount=AT_MYPOWEROFF;//关机
				UART1Ctrl->ATTask=1;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
				UART1Ctrl->LinkTask=5;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
			}
			break;
		default:
			UART1Ctrl->LinkTask=0;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
			return;
	}

	
	if(UART1Ctrl->Lock==0x55)
	{
		return;//0x55=通信功能正在被调用禁止其他程序再次调用
	}	
//AT接收发送
	if(UART1Ctrl->ATTask!=0)//AT任务:0=空闲,1=发送,2=正在发送,3=接收
	{
		GPRS_3763_AT_RxTx();//GPRS_3763模块AT接收发送
		return;
	}
	
