gdgly/NUC97X_JS/STM32F4xx/Device/GPRS_3763_back.c
//376.1接收发送
	switch(UART1Ctrl->Task)
	{
		case 0://接收
			UART1Ctrl->ATTask=1;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
			GPRS_3763_AT_RxTx();//GPRS_3763模块AT接收发送
			break;
		case 2://等待单帧数据发送
		#if MainProtocol==376
		case 5://等待多帧数据发送
			#if (USER/100)==11//吉林系
				USER11xx_TxAddr(GPRSPORT);//吉林系发送帧终端地址2字节长度变为4字节,并重新计算帧校验和,需发送的帧字节数+2
			#endif
			Terminal_Ram->CopyTxByte=UART1Ctrl->TxByte;//发送字节数
			UART1Ctrl->TxCount=0;//已发送计数
			Terminal_Ram->CopyTxCount=0;//已发送计数
			Terminal_Ram->GPRSWaitTx_S_Timer=1*60;//2分,GPRS发送数据等待超时秒定时器
			UART1Ctrl->ATTask=1;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
			UART1Ctrl->ATCount=AT_MYNETWRITE;//发送数据
			UART1Ctrl->ATWriteTask=0;//AT数据发送任务:0=发命令,1=发数据
			UART1Ctrl->Task++;
		#endif
		#if MainProtocol==698
			LEN_UARTnTx=Get_LEN_UARTnTx(GPRSPORT);
			p8tx=(u8 *)Get_ADDR_UARTnTx(GPRSPORT);
			LEN_ADDR=p8tx[4];//取地址字节数
			LEN_ADDR&=0x0f;
			LEN_ADDR++;
			LEN_ADDR+=2;
			LEN_TAPDU=p8tx[1]+(p8tx[2]<<8);//除起始字符和结束字符之外的帧字节数
			LEN_TAPDU-=3+LEN_ADDR+2+2;
			if(LEN_TAPDU<=LENmax_TxAPDU)//链路层分帧发送，每帧最大APDU字节数
			{
			#if LOG_698==1//0=没,1=有
				LOG(698,1,GPRSPORT,(u8 *)Get_ADDR_UARTnTx(GPRSPORT),UART1Ctrl->TxByte,0);//入口:TR=0接收=1发送;protocol=13761,13762,13763,6451997,6452007;ascii=0为hex码=1本身为ascii码
			#endif
			#if DEBUG_698toRS232==1//0=否,1=是;调试:ENET口收发数据打印到RS232口
				LOGRS232(698,1,GPRSPORT,(u8 *)Get_ADDR_UARTnTx(GPRSPORT),UART1Ctrl->TxByte,0);//入口:TR=0接收=1发送;protocol=13761,13762,13763,6451997,6452007;ascii=0为hex码=1本身为ascii码
			#endif
				Terminal_Ram->CopyTxByte=UART1Ctrl->TxByte;//发送字节数
				UART1Ctrl->TxCount=0;//已发送计数
				Terminal_Ram->CopyTxCount=0;//已发送计数
				Terminal_Ram->GPRSWaitTx_S_Timer=1*60;//2分,GPRS发送数据等待超时秒定时器
				UART1Ctrl->ATTask=1;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
				UART1Ctrl->ATCount=AT_MYNETWRITE;//发送数据
				UART1Ctrl->ATWriteTask=0;//AT数据发送任务:0=发命令,1=发数据
				UART1Ctrl->Task++;
			}
			else
			{
				p8tx=(u8 *)Get_ADDR_UARTnTx(GPRSPORT);
				MW((u32)p8tx,(u32)p8tx+LEN_UARTnTx,UART1Ctrl->TxByte);
				UART1Ctrl->TxAPDUSEQ=0;//链路层分帧序号计数0-4095
				UART1Ctrl->TxAPDUByte=0;//链路层分帧已发送APDU字节数
				UART1Ctrl->Task=5;//5=等待链路层分帧数据发送
			}
		#endif
			break;
	#if MainProtocol==698
		case 5://等待多帧数据发送
			LEN_UARTnTx=Get_LEN_UARTnTx(GPRSPORT);
			p8tx=(u8 *)Get_ADDR_UARTnTx(GPRSPORT);
			LEN_ADDR=p8tx[4];//取地址字节数
			LEN_ADDR&=0x0f;
			LEN_ADDR++;
			LEN_ADDR+=2;
			LEN_TAPDU=p8tx[LEN_UARTnTx+1]+(p8tx[LEN_UARTnTx+2]<<8);//除起始字符和结束字符之外的帧字节数
			LEN_TAPDU-=3+LEN_ADDR+2+2;//长度域L和控制域C=3byte,帧头校验=2byte,帧校验=2byte
			MR((u32)p8tx,(u32)p8tx+LEN_UARTnTx,4+LEN_ADDR+2);
			p8tx[3]|=(1<<5);//分帧标志位
			LEN_Tx=4+LEN_ADDR+2;
			i=UART1Ctrl->TxAPDUByte;
			if(i>=LEN_TAPDU)
			{
				UART1Ctrl->RxByte=0;//rx计数=0
				UART1Ctrl->Task=0;//0=接收
				return;
			}
			LEN_TxAPDU=LEN_TAPDU-i;
		//分帧格式域定义
		//bit0~bit11：表示分帧传输过程的帧序号，取值范围0~4095，循环使用；
		//bit12~bit13：保留；
		//bit15=0，bit14=0：表示分帧传输数据起始帧；
		//bit15=1，bit14=0：表示分帧传输确认帧（确认帧不包含APDU片段域）；
		//bit15=0，bit14=1：表示分帧传输最后帧；
		//bit15=1，bit14=1：表示分帧传输中间帧。
			x=UART1Ctrl->TxAPDUSEQ;//链路层分帧序号计数0-4095
			UART1Ctrl->TxAPDUSEQ++;//链路层分帧序号计数0-4095
			x&=0x7ff;
			if(UART1Ctrl->TxAPDUByte==0)
			{//第1帧
				LEN_TxAPDU=LENmax_TxAPDU;
			}
			else
			{
				if(LEN_TxAPDU>LENmax_TxAPDU)//链路层分帧发送，每帧最大APDU字节数
				{//中间帧
					x|=0xC000;
					LEN_TxAPDU=LENmax_TxAPDU;
				}
				else
				{//最后帧
					x|=0x4000;
				}
			}
			p8tx[LEN_Tx]=x;
			p8tx[LEN_Tx+1]=x>>8;
			LEN_Tx+=2;
			MR((u32)p8tx+LEN_Tx,(u32)p8tx+LEN_UARTnTx+4+LEN_ADDR+2+UART1Ctrl->TxAPDUByte,LEN_TxAPDU);
			UART1Ctrl->TxAPDUByte+=LEN_TxAPDU;
			LEN_Tx+=LEN_TxAPDU;
			LEN_Tx+=2+1;
			UART1Ctrl->TxByte=LEN_Tx;
			LEN_Tx-=2;
			p8tx[1]=LEN_Tx;
			p8tx[2]=LEN_Tx>>8;
			Uart_698_HCSFCS(p8tx);//整帧校验计算(HCS和FCS),同时加结束0x16;返回0=正确，1=错误
			#if LOG_68==1//0=没,1=有
			LOG(698,1,GPRSPORT,(u8 *)Get_ADDR_UARTnTx(GPRSPORT),UART1Ctrl->TxByte,0);//入口:TR=0接收=1发送;protocol=13761,13762,13763,6451997,6452007;ascii=0为hex码=1本身为ascii码
			#endif
			#if DEBUG_698toRS232==1//0=否,1=是;调试:ENET口收发数据打印到RS232口
			LOGRS232(698,1,GPRSPORT,(u8 *)Get_ADDR_UARTnTx(GPRSPORT),UART1Ctrl->TxByte,0);//入口:TR=0接收=1发送;protocol=13761,13762,13763,6451997,6452007;ascii=0为hex码=1本身为ascii码
			#endif
			
			Terminal_Ram->CopyTxByte=UART1Ctrl->TxByte;//发送字节数
			UART1Ctrl->TxCount=0;//已发送计数
			Terminal_Ram->CopyTxCount=0;//已发送计数
			Terminal_Ram->GPRSWaitTx_S_Timer=1*60;//2分,GPRS发送数据等待超时秒定时器
			UART1Ctrl->ATTask=1;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
			UART1Ctrl->ATCount=AT_MYNETWRITE;//发送数据
			UART1Ctrl->ATWriteTask=0;//AT数据发送任务:0=发命令,1=发数据
			UART1Ctrl->Task++;
			break;
	#endif
			
		case 3://单帧数据正在发送
		case 6://多帧数据正在发送
			if(UART1Ctrl->ATTask==0)//AT任务:0=空闲,1=发送,2=正在发送,3=接收
			{//不明原因冲突或意外RAM错误等等
				WarningOccur(GPRSPORT,(u8 *)"GPRS任务有BUG");//告警发生,入口告警代码和告警字符串
				UART1Ctrl->LinkTask=0;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
				//重拨间隔定时器置为0以便立即重连
				Terminal_Ram->GPRSReConnection_S_Timer=0;//7 GPRS永久在线、时段在线模式重拨间隔秒定时器
			}
			break;
		case 4://多帧数据续接收完成
			#if MainProtocol==698
				Uart_698_RxTx(GPRSPORT);//UART_3761接收发送
			#else
				Uart_3761_RxTx(GPRSPORT);//UART_3761接收发送
			#endif
			break;
		default:
			#if MainProtocol==698
				Uart_698_RxTx(GPRSPORT);//UART_3761接收发送
			#else
				Uart_3761_RxTx(GPRSPORT);//UART_3761接收发送
			#endif
			break;
	}

}












